import React, { useState, useEffect } from "react";
import Papa from 'papaparse'
import * as DocumentPicker from 'expo-document-picker';
import { View, Button, Alert, StyleSheet, FlatList, Text, ScrollView } from 'react-native';
import iconv from 'iconv-lite';
import { auth, addDoc, db, collection, doc, setDoc, getDoc, fetchSignInMethodsForEmail, projectExtensionAuth, projectExtensionFirestore } from '../../Firebase/firebaseConfig'


const UploadCsv = () => {


    //TOYOTA
    const carModels = [
        "bB",
        "bBオープンデッキ",
        "FJクルーザー",
        "iQ",
        "ist",
        "MR2",
        "MR-S",
        "MRスパイダー",
        "RAV4",
        "RAV4 EV",
        "WiLL Vi",
        "WiLL VS",
        "WiLL サイファ",
        "アイシス",
        "アバロン",
        "アベンシス",
        "アベンシスワゴン",
        "アリオン",
        "アリスト",
        "アルテッツァ",
        "アルテッツァジータ",
        "アルファード",
        "アルファードハイブリッド",
        "アレックス",
        "イプサム",
        "ヴァンガード",
        "ウィッシュ",
        "ヴィッツ",
        "ウィンダム",
        "ヴェルファイア",
        "ヴェロッサ",
        "ヴォクシー",
        "ヴォルツ",
        "エスティマ",
        "エスティマエミーナ",
        "エスティマハイブリッド",
        "エスティマルシーダ",
        "オーパ",
        "オーリス",
        "オリジン",
        "ガイア",
        "カムリ",
        "カムリグラシア",
        "カムリグラシアワゴン",
        "カリーナ",
        "カリーナED",
        "カリーナサーフ",
        "カルディナ",
        "カルディナバン",
        "カレン",
        "カローラ",
        "カローラFX",
        "カローラII",
        "カローラアクシオ",
        "カローラスパシオ",
        "カローラセレス",
        "カローラバン",
        "カローラフィールダー",
        "カローラランクス",
        "カローラルミオン",
        "カローラレビン",
        "カローラレビンハッチバック",
        "カローラワゴン",
        "キャバリエ",
        "キャバリエクーペ",
        "キャミ",
        "クラウンハードトップ",
        "クラウンアスリート",
        "クラウンエステート",
        "クラウンコンフォート",
        "クラウンセダン",
        "クラウンハイブリッド",
        "クラウンバン",
        "クラウンマジェスタ",
        "クラウンロイヤル",
        "クラウンワゴン",
        "グラシア",
        "クラシック",
        "グランドハイエース",
        "グランビア",
        "クルーガー",
        "クルーガーハイブリッド",
        "クレスタ",
        "コルサ",
        "コルサセダン",
        "コロナ",
        "コロナエクシヴ",
        "コロナクーペ",
        "コロナプレミオ",
        "ＳＡＩ",
        "サイノス",
        "サイノスコンバーチブル",
        "サクシード",
        "サクシードバン",
        "シエンタ",
        "スープラ",
        "スターレット",
        "スパーキー",
        "スプリンター",
        "スプリンターカリブ",
        "スプリンターシエロ",
        "スプリンタートレノ",
        "スプリンタートレノハッチバック",
        "スプリンターバン",
        "スプリンターマリノ",
        "スプリンターワゴン",
        "セプター",
        "セプタークーペ",
        "セプターワゴン",
        "セラ",
        "セリカ",
        "セリカコンバーチブル",
        "セルシオ",
        "センチュリー",
        "ソアラ",
        "ソアラエアロキャビン",
        "ターセル",
        "ターセルセダン",
        "タウンエース",
        "タウンエーストラック",
        "タウンエースノア",
        "タウンエースノアバン",
        "タウンエースバン",
        "チェイサー",
        "ツーリングハイエース",
        "デュエット",
        "ナディア",
        "ノア",
        "ハイエース",
        "ハイエースバン",
        "ハイエースレジアス",
        "ハイラックス",
        "ハイラックスサーフ",
        "パッソ",
        "パッソセッテ",
        "ハリアー",
        "ハリアーハイブリッド",
        "ビスタ",
        "ビスタアルデオ",
        "ファンカーゴ",
        "プラッツ",
        "プリウス",
        "プリウスEX",
        "ブリザード",
        "ブレイド",
        "ブレビス",
        "プレミオ",
        "プログレ",
        "プロナード",
        "プロボックス",
        "プロボックスバン",
        "ベルタ",
        "ポルテ",
        "マークIIハードトップ",
        "マークIIクオリス",
        "マークIIセダン",
        "マークIIバン",
        "マークIIブリット",
        "マークIIワゴン",
        "マークX",
        "マークXジオ",
        "マスターエースサーフ",
        "メガクルーザー",
        "ライトエース",
        "ライトエーストラック",
        "ライトエースノア",
        "ライトエースノアバン",
        "ライトエースバン",
        "ラウム",
        "ラクティス",
        "ラッシュ",
        "ランドクルーザー60",
        "ランドクルーザー70",
        "ランドクルーザー80",
        "ランドクルーザー100",
        "ランドクルーザー200",
        "ランドクルーザーシグナス",
        "ランドクルーザープラド",
        "レジアス",
        "レジアスエース",
        "コロナSF",
        "ハイエーストラック",
        "プリウスアルファ",
        "コンフォート",
        "ダイナ",
        "トヨエース",
        "コースター",
        "クイックデリバリー",
        "ヴェルファイアハイブリッド",
        "カムリハイブリッド",
        "ピクシス スペース",
        "アクア",
        "86",
        "ピクシス バン",
        "ピクシス トラック",
        "ピクシス エポック",
        "スペード",
        "ノア ハイブリッド",
        "ヴォクシー ハイブリッド",
        "エスクァイア",
        "エスクァイアハイブリッド",
        "ミライ",
        "ピクシス メガ",
        "シエンタ ハイブリッド",
        "ピクシス ジョイ",
        "タンク",
        "ルーミー",
        "C-HR",
        "ハイエースコミューター",
        "ジャパンタクシー",
        "グランエース",
        "その他",
    ];
    //LEXUS
    const carModelsLexus = [
        "ＣＴ",
        "ＧＳ",
        "ＧＳハイブリッド",
        "ＨＳ",
        "ＩＳ",
        "ＩＳ Ｆ",
        "ＩＳコンバーチブル",
        "ＬＳ",
        "ＬＳハイブリッド",
        "ＲＸ",
        "ＲＸハイブリッド",
        "ＳＣ",
        "ＬＦＡ",
        "ＩＳハイブリッド",
        "NXハイブリッド",
        "NXハイブリッド",
        "RC",
        "RCハイブリッド",
        "RC F",
        "LX",
        "GS F",
        "NX",
        "LC",
        "LCハイブリッド"
    ];
    //ISUZU
    const carModelsIsuzu = [
        "PAネロ",
        "PAネロハッチバック",
        "アスカ",
        "アスカCX",
        "ウィザード",
        "ジェミニ",
        "ジェミニクーペ",
        "ジェミニハッチバック",
        "ピアッツァ",
        "ピアッツァネロ",
        "ビークロス",
        "ビッグホーン",
        "ファーゴ",
        "ファーゴトラック",
        "ファーゴバン",
        "ファーゴフィリー",
        "ファスター",
        "フィリー",
        "ミュー",
        "ミューウィザード",
        "ロデオ",
        "コモ",
        "ELF TRUCK",
        "JOURNEY BUS",
        "JUSTON",
        "FORWARD",
        "ギガ"
    ]
    //NISSAN
    const carModelsNissan = [
        "180SX",
        "AD",
        "AD-MAXバン",
        "AD-MAXワゴン",
        "ADエキスパート",
        "ADバン",
        "ADワゴン",
        "Be-1",
        "GT-R",
        "NV200バネット",
        "NV200バネットバン",
        "NXクーペ",
        "アベニール",
        "アベニールカーゴ",
        "インフィニティQ45",
        "ウイングロード",
        "エキスパート",
        "エクストレイル",
        "エスカルゴ",
        "エルグランド",
        "オッティ",
        "キックス",
        "キャラバン",
        "キャラバンコーチ",
        "キューブ",
        "キューブキュービック",
        "クエスト",
        "クリッパー",
        "クリッパートラック",
        "クリッパーリオ",
        "クルー",
        "グロリア",
        "グロリアセダン",
        "グロリアバン",
        "グロリアワゴン",
        "サニー",
        "サニーRZ-1",
        "サニーカリフォルニア",
        "サファリ",
        "シーマ",
        "ジューク",
        "シルビア",
        "シルビアヴァリエッタ",
        "シルビアコンバーチブル",
        "スカイライン",
        "スカイラインGT-R",
        "スカイラインGT-Rセダン",
        "スカイラインクーペ",
        "スカイラインクロスオーバー",
        "ステージア",
        "セドリック",
        "セドリックセダン",
        "セドリックバン",
        "セドリックワゴン",
        "セフィーロ",
        "セフィーロワゴン",
        "セレナ",
        "セレナカーゴ",
        "ダットサン",
        "ティアナ",
        "ティーダ",
        "ティーダラティオ",
        "ティーノ",
        "デュアリス",
        "テラノ",
        "テラノレグラス",
        "ノート",
        "ハイパーミニ",
        "パオ",
        "バサラ",
        "バネット",
        "バネットセレナ",
        "バネットトラック",
        "バネットラルゴ",
        "パルサー",
        "パルサーセダン",
        "パルサーセリエ",
        "パルサーセリエS-RV",
        "ピノ",
        "フィガロ",
        "フーガ",
        "フーガハイブリッド",
        "フェアレディZ",
        "フェアレディZコンバーチブル",
        "フェアレディZロードスター",
        "プリメーラ",
        "プリメーラカミノ",
        "プリメーラカミノワゴン",
        "プリメーラハッチバック",
        "プリメーラワゴン",
        "ブルーバード",
        "ブルーバードARX",
        "ブルーバードオージィー",
        "ブルーバードシルフィ",
        "ブルーバードハードトップ",
        "プレーリージョイ",
        "プレーリーリバティ",
        "プレサージュ",
        "プレジデント",
        "プレセア",
        "ホーミー",
        "ホーミーコーチ",
        "マーチ",
        "マーチBOX",
        "マーチカブリオレ",
        "マイクラCプラスC",
        "マキシマ",
        "ミストラル",
        "ムラーノ",
        "モコ",
        "ラシーン",
        "ラフェスタ",
        "ラルゴ",
        "リーフ",
        "リバティ",
        "ルークス",
        "ルキノ",
        "ルキノS-RV",
        "ルキノクーペ",
        "ルネッサ",
        "レパード",
        "レパードJ.フェリー",
        "ローレル",
        "スカイライン２ドアＨＴ",
        "パルサーＥＸＡ",
        "ブルーバードマキシマ",
        "ブルーバードワゴン",
        "ブルーバードバン",
        "プレーリー",
        "ガゼール",
        "スタンザ",
        "チェリー",
        "オースター",
        "バイオレット",
        "ローレルスピリット",
        "ラングレー",
        "リベルタビラ",
        "サニートラック",
        "ラフェスタハイウェイスター",
        "ラティオ",
        "シルフィ",
        "デイズ",
        "デイズルークス",
        "スカイライン ハイブリッド",
        "スカイライン ハイブリッド",
        "ラングレー",
        "リベルタビラ",
        "サニートラック",
        "NV100クリッパーリオ",
        "エクストレイルハイブリッド",
        "NV150 AD",
        "NV100クリッパー",
        "NT100クリッパー",
        "シーマハイブリッド",
        "NV350キャラバン",
        "CIVILIAN BUS",
        "Atlas",
        "CIVILIAN",
        "CONDOR"
    ]
    //HONDA
    const carModelsHonda = [
        "CR-V",
        "CR-X",
        "CR-Xデルソル",
        "CR-Z",
        "HR-V",
        "MDX",
        "NSX",
        "NSX-R",
        "S2000",
        "S-MX",
        "Z",
        "アヴァンシア",
        "アクティトラック",
        "アクティバン",
        "アコード",
        "アコードインスパイア",
        "アコードエアロデッキ",
        "アコードクーペ",
        "アコードツアラー",
        "アコードワゴン",
        "アスコット",
        "アスコットイノーバ",
        "インサイト",
        "インスパイア",
        "インテグラ",
        "インテグラSJ",
        "インテグラセダン",
        "インテグラタイプR",
        "インテグラタイプRセダン",
        "エアウェイブ",
        "エディックス",
        "エリシオン",
        "エレメント",
        "オデッセイ",
        "オルティア",
        "キャパ",
        "クロスロード",
        "コンチェルト",
        "コンチェルトハッチバック",
        "ザッツ",
        "シティ",
        "シビック",
        "シビッククーペ",
        "シビックシャトル",
        "シビックセダン",
        "シビックタイプR",
        "シビックタイプRユーロ",
        "シビックハイブリッド",
        "シビックフェリオ",
        "ジャズ",
        "ステップワゴン",
        "ストリート",
        "ストリーム",
        "セイバー",
        "ゼスト",
        "トゥデイ",
        "ドマーニ",
        "トルネオ",
        "パートナー",
        "バモス",
        "バモスホビオ",
        "バモスホビオバン",
        "ビート",
        "ビガー",
        "フィット",
        "フィットハイブリッド",
        "フィットアリア",
        "フリード",
        "フリードスパイク",
        "プレリュード",
        "プレリュードインクス",
        "ホライゾン",
        "モビリオ",
        "モビリオスパイク",
        "ライフ",
        "ラグレイト",
        "ラファーガ",
        "レジェンド",
        "レジェンドクーペ",
        "ロゴ",
        "バラードCR-X",
        "レジェンドＨＴ",
        "バラード",
        "クイントインテグラ",
        "フィットシャトル",
        "フィットシャトルハイブリッド",
        "フリードハイブリッド",
        "フリードスパイクハイブリッド",
        "Ｎ ＢＯＸ",
        "Ｎ ＢＯＸ +",
        "N-ONE",
        "アコードハイブリッド",
        "N-WGN",
        "ヴェゼル",
        "ヴェゼルハイブリッド",
        "レジェンドハイブリッド",
        "グレイス",
        "N BOXスラッシュ",
        "ジェイド",
        "S660",
        "シャトルハイブリッド",
        "クラリティ フューエル セル",
        "フリード +"
    ]
    //MITSUBISHI
    const carModelsMitsubishi = [
        "ekアクティブ",
        "ekクラッシィ",
        "eKスポーツ",
        "eKワゴン",
        "FTO",
        "GTO",
        "RVR",
        "アイ",
        "アイミーブ",
        "アウトランダー",
        "アスパイア",
        "エアトレック",
        "エクリプス",
        "エクリプススパイダー",
        "エテルナ",
        "エテルナサバ",
        "エメロード",
        "カリスマ",
        "ギャラン",
        "ギャランスポーツ",
        "ギャランフォルティス",
        "ギャランフォルティススポーツバック",
        "グランディス",
        "コルト",
        "コルトプラス",
        "ジープ",
        "シグマ",
        "シャリオ",
        "シャリオグランディス",
        "スタリオン",
        "ストラーダ",
        "タウンボックス",
        "タウンボックスワイド",
        "チャレンジャー",
        "ディアマンテ",
        "ディアマンテワゴン",
        "ディオン",
        "ディグニティ",
        "デボネア",
        "デリカD：2",
        "デリカD：5",
        "デリカカーゴ",
        "デリカスターワゴン",
        "デリカスペースギア",
        "デリカトラック",
        "デリカバン",
        "トッポ",
        "トッポBJ",
        "トッポBJワイド",
        "トライトン",
        "パジェロ",
        "パジェロイオ",
        "パジェロジュニア",
        "パジェロミニ",
        "プラウディア",
        "ブラボー",
        "ミニカ",
        "ミニカタウンビー",
        "ミニカトッポ",
        "ミニカトッポタウンビー",
        "ミニキャブトラック",
        "ミニキャブバン",
        "ミニキャブブラボー",
        "ミラージュ",
        "ミラージュアスティ",
        "ミラージュセダン",
        "ミラージュディンゴ",
        "ランサー",
        "ランサーエボリューション",
        "ランサーエボリューションワゴン",
        "ランサーカーゴ",
        "ランサーセディア",
        "ランサーセディアワゴン",
        "ランサーワゴン",
        "リベロカーゴ",
        "リベロ",
        "レグナム",
        "ピスタチオ",
        "デリカD：3",
        "アウトランダーPHEV",
        "キャンター",
        "eKカスタム",
        "eKスペース",
        "eKスペースカスタム",
        "ミニキャブミーブ トラック",
        "ミニキャブミーブ",
        "エクリプスクロス",
        "CANTER GUTS",
        "FIGHTER",
        "FIGHTER MIGNON"
    ]
    //MAZDA
    const carModelsMazda = [
        "AZ-1",
        "AZ-3",
        "AZ-オフロード",
        "AZ-ワゴン",
        "CX-7",
        "MPV",
        "アンフィニMPV",
        "MS-6",
        "MS-8",
        "MS-9",
        "MX-6",
        "RX-7",
        "サバンナRX-7",
        "アンフィニRX-7",
        "サバンナRX-7カブリオレ",
        "アクセラ",
        "アクセラスポーツ",
        "アテンザ",
        "アテンザスポーツ",
        "アテンザスポーツワゴン",
        "カペラ",
        "カペラＣ２",
        "カペラＣＧ",
        "カペラカーゴ",
        "カペラワゴン",
        "キャロル",
        "クレフ",
        "クロノス",
        "コスモ",
        "ユーノスコスモ",
        "スクラムワゴン",
        "スクラムトラック",
        "スピアーノ",
        "センティア",
        "デミオ",
        "トリビュート",
        "ビアンテ",
        "ファミリアアスティナ",
        "ファミリアS-ワゴン",
        "ファミリアNEO",
        "ファミリアビジネスワゴン",
        "ファミリアワゴン",
        "ファミリアバン",
        "ファミリアセダン",
        "プレマシー",
        "プロシード",
        "プロシードマービー",
        "プロシードレバンテ",
        "ベリーサ",
        "ペルソナ",
        "ボンゴフレンディ",
        "ボンゴトラック",
        "ボンゴバン",
        "ボンゴワゴン",
        "ボンゴブローニイトラック",
        "ボンゴブローニイバン",
        "ボンゴブローニイワゴン",
        "ミレーニア",
        "ユーノス100",
        "ユーノス300",
        "ユーノス500",
        "ユーノス800",
        "ユーノスカーゴ",
        "ユーノスプレッソ",
        "ラピュタ",
        "ランティス",
        "ランティスクーペ",
        "ルーチェ",
        "レビュー",
        "ロードスター",
        "ユーノスロードスター",
        "ロードスタークーペ",
        "ファミリアハッチバック",
        "ファミリアカブリオレ",
        "エチュード",
        "カスタムキャブ",
        "RX-8",
        "スクラムバン",
        "カペラバン",
        "タイタン",
        "CX-5",
        "フレアワゴン",
        "フレア",
        "フレアクロスオーバー",
        "アクセラハイブリッド",
        "アテンザワゴン",
        "CX-3",
        "ロードスターRF",
        "CX-8"
    ]
    //SUBARU
    const carModelsSubaru = [
        "R1",
        "R2",
        "アルシオーネ",
        "アルシオーネSVX",
        "インプレッサ",
        "インプレッサSTI",
        "インプレッサXV",
        "インプレッサアネシス",
        "インプレッサクーペ",
        "インプレッサスポーツワゴン",
        "インプレッサスポーツワゴンSTI",
        "インプレッサハッチバック",
        "インプレッサハッチバックSTI",
        "ヴィヴィオ",
        "ヴィヴィオタルガトップ",
        "ヴィヴィオビストロ",
        "エクシーガ",
        "サンバー",
        "サンバーディアスバン",
        "サンバーディアスワゴン",
        "サンバートラック",
        "ジャスティ",
        "ステラ",
        "ディアスワゴン",
        "デックス",
        "ドミンゴ",
        "トラヴィック",
        "トレジア",
        "フォレスター",
        "プレオ",
        "ルクラ",
        "レガシィB4",
        "レガシィアウトバック",
        "レガシィグランドワゴン",
        "レガシィセダン",
        "レガシィツーリングワゴン",
        "レガシィランカスター",
        "レックス",
        "レオーネ",
        "レオーネ クーペ",
        "レオーネ ワゴン",
        "レオーネ バン",
        "BRZ",
        "ＷＲＸＳＴＩ ハッチバック",
        "プレオプラス",
        "インプレッサXV ハイブリッド",
        "レヴォーグ",
        "インプレッサXV",
        "インプレッサスポーツ",
        "インプレッサG4",
        "WRXSTI",
        "WRXS4",
        "エクシーガ クロスオーバー7",
        "シフォン",
        "レヴォーグ"
    ]
    //SUZUKI
    const carModelsSuzuki = [
        "Kei",
        "MRワゴン",
        "SX4",
        "SX4セダン",
        "X-90",
        "アルト",
        "アルトラパン",
        "アルトワークス",
        "エスクード",
        "エブリイ",
        "エブリイプラス",
        "エブリイランディ",
        "エブリイワゴン",
        "エリオ",
        "エリオセダン",
        "カプチーノ",
        "カルタス",
        "カルタスエスティーム",
        "カルタスクレセント",
        "カルタスクレセントセダン",
        "カルタスクレセントワゴン",
        "カルタスコンバーチブル",
        "カルタスセダン",
        "カルタスワゴン",
        "キザシ",
        "キャラ",
        "キャリイ",
        "キャリイバン",
        "グランドエスクード",
        "ジムニー",
        "ジムニーシエラ",
        "ジムニーワイド",
        "スイフト",
        "スプラッシュ",
        "セルボ",
        "セルボモード",
        "ソリオ",
        "ツイン",
        "パレット",
        "ランディ",
        "ワゴンR",
        "ワゴンRソリオ",
        "ワゴンRプラス",
        "ワゴンRワイド",
        "アルト エコ",
        "スペーシア",
        "ハスラー",
        "SX4 S-CROSS",
        "イグニス",
        "バレーノ",
        "クロスビー"
    ]
    //DAIHATSU
    const carModelsDaihatsu = [
        "MAX",
        "YRV",
        "アトレー",
        "アトレー7",
        "アトレーワゴン",
        "アプローズ",
        "アルティス",
        "エッセ",
        "オプティ",
        "クー",
        "コペン",
        "シャレード",
        "シャレードソシアル",
        "ストーリア",
        "ソニカ",
        "タント",
        "タントエグゼ",
        "テリオス",
        "テリオスキッド",
        "テリオスルキア",
        "デルタトラック",
        "デルタバン",
        "デルタルートバン",
        "デルタワイドバン",
        "デルタワイドワゴン",
        "デルタワゴン",
        "ネイキッド",
        "パイザー",
        "ハイゼットカーゴ",
        "ハイゼットカーゴハイブリッド",
        "ハイゼットグランカーゴ",
        "ハイゼットトラック",
        "ハイゼットバン",
        "ハイゼットピック",
        "ビーゴ",
        "ブーン",
        "ブーンルミナス",
        "ミゼットII",
        "ミラ",
        "ミラアヴィ",
        "ミラココア",
        "ミラジーノ",
        "ミラジーノ1000",
        "ムーヴ",
        "ムーヴコンテ",
        "ムーヴラテ",
        "ラガー",
        "リーザ",
        "リーザスパイダー",
        "ロッキー",
        "ミライース",
        "アルティスハイブリッド",
        "メビウス",
        "ウェイク",
        "キャスト",
        "ハイゼットキャディー",
        "ムーヴキャンバス",
        "トール"
    ]
    //MITSUOKA MOTOR
    const carModelsMitsuokaMotor = [
        "オロチ",
        "ガリュー",
        "ガリュー204",
        "ガリューI",
        "ガリューII",
        "ガリューIII",
        "ガリュークラシック",
        "ガリューコンバーチブル",
        "ガリューリムジンS50",
        "ゼロ1",
        "ヌエラ",
        "ヌエラ6-02",
        "ヌエラ6-02ワゴン",
        "ヒミコ",
        "ビュート",
        "ユーガ",
        "ライク",
        "ラ・セード",
        "リョーガ",
        "リョーガワゴン",
        "レイ",
        "リューギ"
    ]
    //TOMMY KAIRA
    const carModelsTommyKaira = [
        "ZZ"
    ]
    //ZERO SPORTS
    const carModelsZeroSports = [
        "ゼロＥＶエレクシードＲＳ"
    ]
    //MERCEDES BENZ
    const carModelsMercedesBenz = [
        "190クラス",
        "Aクラス",
        "Bクラス",
        "CLKクラス",
        "CLKクラスカブリオレ",
        "CLSクラス",
        "CLクラス",
        "Cクラス",
        "Cクラススポーツクーペ",
        "Cクラスワゴン",
        "Eクラス",
        "Eクラスカブリオレ",
        "Eクラスクーペ",
        "Eクラスワゴン",
        "GLKクラス",
        "GLクラス",
        "Gクラス",
        "Mクラス",
        "Rクラス",
        "SLKクラス",
        "SLRクラス マクラーレン",
        "SLRクラス マクラーレン ロードスター",
        "SLクラス",
        "Sクラス",
        "Sクラスクーペ",
        "Vクラス",
        "バネオ",
        "ビアノ",
        "ミディアムクラス",
        "ミディアムクラスカブリオレ",
        "ミディアムクラスクーペ",
        "ミディアムクラスワゴン/Tシリーズ",
        "Cクラスクーペ",
        "CLSクラスシューティングブレーク",
        "CLAクラス",
        "SLSクラス",
        "GLAクラス",
        "CLAクラスシューティングブレーク",
        "Cクラスカブリオレ",
        "GLCクラス",
        "GLCクラスクーペ",
        "GLEクラス",
        "GLEクラスクーペ",
        "GLSクラス",
        "SLCクラス",
        "Sクラスカブリオレ"
    ]
    //BMW
    const carModelsBMW = [
        "1シリーズ",
        "1シリーズカブリオレ",
        "1シリーズクーペ",
        "3シリーズ",
        "3シリーズカブリオレ",
        "3シリーズクーペ",
        "3シリーズコンパクト",
        "3シリーズツーリング",
        "5シリーズ",
        "5シリーズグランツーリスモ",
        "5シリーズツーリング",
        "6シリーズ",
        "6シリーズカブリオレ",
        "7シリーズ",
        "8シリーズ",
        "M3",
        "M3セダン",
        "M5",
        "M6",
        "M6 カブリオレ",
        "X1",
        "X3",
        "X5",
        "X5 M",
        "X6",
        "X6 M",
        "Z3",
        "Z3 Mクーペ",
        "Z3 Mロードスター",
        "Z3クーペ",
        "Z4",
        "Z4 Mクーペ",
        "Z4 Mロードスター",
        "Z4クーペ",
        "Z8",
        "6シリーズ グランクーペ",
        "M6 グランクーペ",
        "3シリーズ グランツーリスモ",
        "４シリーズ",
        "M1",
        "2シリーズ",
        "M2",
        "i3",
        "i8",
        "4シリーズグランクーペ",
        "4シリーズカブリオレ",
        "M4",
        "2シリーズ アクティブツアラー",
        "X4",
        "2シリーズカブリオレ",
        "2シリーズグランツアラー",
        "6シリーズ グランツーリスモ",
        "X2"
    ]
    //VOLKSWAGEN
    const carModelsVolkswagen = [
        "イオス",
        "ヴァナゴン",
        "ヴェント",
        "クロスゴルフ",
        "クロスポロ",
        "コラード",
        "ゴルフ",
        "ゴルフヴァリアント",
        "ゴルフカブリオ",
        "ゴルフトゥーラン",
        "ゴルフプラス",
        "ゴルフワゴン",
        "サンタナ",
        "ジェッタ",
        "シャラン",
        "シロッコ",
        "ティグアン",
        "トゥアレグ",
        "ニュービートル",
        "ニュービートルカブリオレ",
        "パサート",
        "パサートCC",
        "パサートバリアント",
        "パサートワゴン",
        "ボーラ",
        "ポロ",
        "ルポ",
        "ザ・ビートル",
        "アップ！",
        "パサートオールトラック",
        "フォルクスワーゲンＣＣ",
        "ザ・ビートルカブリオレ",
        "ゴルフオールトラック",
        "アルテオン",
        "e-ゴルフ",
        "e-アップ!"
    ]
    //AUDI
    const carModelsAudi = [
        "100",
        "100アバント",
        "80",
        "80アバント",
        "90",
        "A1",
        "A3",
        "A3スポーツバック",
        "A4",
        "A4アバント",
        "A4オールロードクワトロ",
        "A4カブリオレ",
        "A5",
        "A5カブリオレ",
        "A5スポーツバック",
        "A6",
        "A6アバント",
        "A6オールロードクワトロ",
        "A8",
        "Q5",
        "Q7",
        "R8",
        "R8スパイダー",
        "RS4",
        "RS4アバント",
        "RS5",
        "RS6",
        "RS6アバント",
        "S3",
        "S3スポーツバック",
        "S4",
        "S4アバント",
        "S5",
        "S5カブリオレ",
        "S6",
        "S6アバント",
        "S8",
        "TT",
        "TTSクーペ",
        "TTロードスター",
        "TT RSクーペ",
        "V8",
        "アウディカブリオレ",
        "アウディクーペ",
        "オールロードクワトロ",
        "Ａ７スポーツバック",
        "S5スポーツバック",
        "A1スポーツバック",
        "Q3",
        "S7スポーツバック",
        "Q5ハイブリッド",
        "A8ハイブリッド",
        "TT RSﾌﾟﾗｽクーペ",
        "RS5カブリオレ",
        "SQ5",
        "Ａ３セダン",
        "Ｓ３セダン",
        "ＲＳ７スポーツバック",
        "S1",
        "S1スポーツバック",
        "S3セダン",
        "RS3スポーツバック",
        "RSQ3",
        "S8プラス",
        "Q2",
        "TT RSロードスター"
    ]
    //MINI
    const carModelsMini = [
        "ミニ",
        "ミニクラブマン",
        "ミニクロスオーバー",
        "ミニコンバーチブル",
        "ミニクーペ",
        "ミニロードスター",
        "ミニペースマン"
    ]
    //PORSCHE
    const carModelsPorsche = [
        "911",
        "911カブリオレ",
        "928",
        "968",
        "968カブリオレ",
        "カイエン",
        "ケイマン",
        "パナメーラ",
        "ボクスター",
        "マカン",
        "718"
    ]
    //OPEL
    const carModelsOpel = [
        "アストラ",
        "アストラカブリオ",
        "アストラクーペ",
        "アストラセダン",
        "アストラワゴン",
        "ヴィータ",
        "オメガ",
        "オメガワゴン",
        "カリブラ",
        "ザフィーラ",
        "シグナム",
        "スピードスター",
        "セネター",
        "ティグラ",
        "ベクトラ",
        "ベクトラGTS",
        "ベクトラワゴン",
        "メリーバ"
    ]
    //SMART 
    const carModelsSmart = [
        "K",
        "カブリオ",
        "クーペ",
        "クロスブレード",
        "フォーツーK",
        "フォーツーカブリオ",
        "フォーツークーペ",
        "フォーフォー",
        "ロードスター",
        "ロードスタークーペ",
        "フォーツーエレクトリックドライブ"
    ]
    //AMG 
    const carModelsAMG = [
        "CLKクラス",
        "CLKクラスカブリオレ",
        "CLSクラス",
        "CLクラス",
        "Cクラス",
        "Cクラスワゴン",
        "Eクラス",
        "Eクラスワゴン",
        "Gクラス",
        "Mクラス",
        "Rクラス",
        "SLKクラス",
        "SLクラス",
        "SLSクラス",
        "Sクラス",
        "Sクラスクーペ",
        "Cクラスクーペ",
        "MLクラス",
        "Aクラス",
        "CLAクラス",
        "CLSクラスシューティングブレーク",
        "GLAクラス",
        "CLAクラスシューティングブレーク",
        "GLクラス",
        "GTクラス",
        "Cクラスカブリオレ",
        "GLCクラス",
        "GLCクラスクーペ",
        "GLEクラス",
        "GLEクラスクーペ",
        "SLCクラス",
        "Sクラスカブリオレ",
        "GLSクラス"
    ]
    //BMW ALPINA 
    const carModelsBMWAlpina = [
        "B10",
        "B10ツーリング",
        "B11",
        "B12",
        "B12クーペ",
        "B3リムジン",
        "B3カブリオ",
        "B3クーペ",
        "B3ツーリング",
        "B5リムジン",
        "B5ツーリング",
        "B6カブリオ",
        "B6クーペ",
        "B7",
        "B8カブリオ",
        "B8クーペ",
        "B8ツーリング",
        "B8リムジン",
        "D3 リムジン",
        "D3クーペ",
        "D3ツーリング",
        "ロードスター",
        "ロードスターV8",
        "D5 リムジン",
        "D4クーペ",
        "B4クーペ",
        "B4カブリオ",
        "XD3"
    ]
    //MAYBACH
    const carModelsMaybach = [
        "マイバッハ"
    ]
    //CITROEN
    const carModelsCitroen = [
        "AX",
        "BX",
        "BXブレーク",
        "C2",
        "C3",
        "C3プルリエル",
        "C4",
        "C4クーペ",
        "C4ピカソ",
        "C5",
        "C5セダン",
        "C5ツアラー",
        "C5ブレーク",
        "C6",
        "DS3",
        "XM",
        "XMブレーク",
        "ZX",
        "ZXクーペ",
        "ZXブレーク",
        "エグザンティア",
        "エクザンティアブレーク",
        "クサラ",
        "クサラピカソ",
        "クサラブレーク",
        "サクソ",
        "シャンソン",
        "DS4",
        "DS5",
        "DS3カブリオ",
        "C4カクタス",
        "グランドC4ピカソ",
        "DS7"
    ]
    //PEUGEOT
    const carModelsPeugeot = [
        "1007",
        "106",
        "205",
        "205カブリオレ",
        "206",
        "206CC",
        "206SW",
        "207",
        "207CC",
        "207SW",
        "3008",
        "306",
        "306カブリオレ",
        "306セダン",
        "306ブレーク",
        "307",
        "307CC",
        "307SW",
        "307ブレーク",
        "308",
        "308CC",
        "308SW",
        "309",
        "405",
        "405ブレーク",
        "406",
        "406クーペ",
        "406ブレーク",
        "407",
        "407SW",
        "605",
        "607",
        "RCZ",
        "クーペ407",
        "508",
        "508SW",
        "208",
        "2008",
        "5008"
    ]
    //RENAULT
    const carModelsRenault = [
        "21",
        "25",
        "5",
        "アヴァンタイム",
        "アルピーヌ",
        "カングー",
        "カングービボップ",
        "グランセニック",
        "コレオス",
        "サフラン",
        "セニック",
        "セニックRX-4",
        "トゥインゴ",
        "メガーヌ",
        "メガーヌカブリオレ",
        "メガーヌクーペ",
        "メガーヌセニック",
        "メガーヌツーリングワゴン",
        "ラグナ",
        "ラグナワゴン",
        "ルーテシア",
        "ウインド",
        "メガーヌエステート",
        "キャプチャー",
        "カジャー"
    ]
    //FIAT
    const carModelsFiat = [
        "500(チンクエチェント)",
        "500C",
        "ウーノ",
        "クーペフィアット",
        "グランデプント",
        "クロマ",
        "ティーポ",
        "テムプラ",
        "パンダ",
        "ブラビッシモ",
        "プント",
        "プントエヴォ",
        "プントカブリオ",
        "ムルティプラ",
        "500S",
        "500X",
        "アバルト124スパイダー",
        "アバルト595",
        "アバルト595C",
        "アバルト695"
    ]
    //FERRARI
    const carModelsFerrari = [
        "348",
        "360スパイダー",
        "360モデナ",
        "430スクーデリア",
        "456GT",
        "456M GT",
        "458イタリア",
        "550マラネロ",
        "575Mマラネロ",
        "599",
        "612スカリエッティ",
        "F355",
        "F355スパイダー",
        "F430",
        "F430スパイダー",
        "カリフォルニア",
        "スーパーアメリカ",
        "チャレンジストラダーレ",
        "テスタロッサ",
        "モンディアル",
        "モンディアルカブリオレ",
        "458スパイダー",
        "FF",
        "カリフォルニアＴ",
        "GTC4ルッソ",
        "812スーパーファスト",
        "488GTB",
        "488スパイダー",
        "ポルトフィーノ"
    ]
    //MASERATI
    const carModelsMaserati = [
        "222",
        "228",
        "3200GT",
        "430",
        "カリフ",
        "ギブリ",
        "クアトロポルテ",
        "クーペ",
        "グラントゥーリズモ",
        "シャマル",
        "スパイダー",
        "スパイダーザガート",
        "ロイヤル",
        "グランカブリオ",
        "レヴァンテ"
    ]
    //ALFA ROMEO
    const carModelsAlfaRomeo = [
        "8C",
        "アルファ145",
        "アルファ147",
        "アルファ155",
        "アルファ156",
        "アルファ156スポーツワゴン",
        "アルファ159",
        "アルファ159スポーツワゴン",
        "アルファ164",
        "アルファ166",
        "アルファ75",
        "アルファGT",
        "アルファGTV",
        "アルファスパイダー",
        "アルファブレラ",
        "ミト",
        "ジュリエッタ",
        "4C",
        "ジュリア"
    ]
    //LANCIA
    const carModelsLancia = [
        "テーマ",
        "デドラ",
        "デルタ",
        "イプシロン"
    ]
    //LAMBORGHINI
    const carModelsLambo = [
        "ガヤルド",
        "ガヤルトスパイダー",
        "ディアブロ",
        "ムルシエラゴ",
        "ムルシエラゴロードスター",
        "アヴェンタドール",
        "ウルス"
    ]
    //LAND ROVER
    const carModelsLandRover = [
        "ディスカバリー",
        "ディスカバリー3",
        "ディスカバリー4",
        "ディフェンダー",
        "フリーランダー",
        "フリーランダー2",
        "レンジローバー",
        "レンジローバーヴォーグ",
        "レンジローバースポーツ",
        "レンジローバーイヴォーク",
        "ディスカバリースポーツ",
        "レンジローバーヴェラール"
    ]
    //ROVER
    const carModelsRover = [
        "100シリーズ",
        "200シリーズ",
        "200シリーズカブリオレ",
        "200シリーズクーペ",
        "400シリーズ",
        "400シリーズツアラー",
        "600シリーズ",
        "75シリーズ",
        "75シリーズツアラー",
        "800シリーズ",
        "800シリーズエステート",
        "800シリーズクーペ",
        "800シリーズハッチバック",
        "ミニ"
    ]
    //JAGUAR
    const carModelsJaguar = [
        "Sタイプ",
        "XF",
        "XJ",
        "XJ-Sクーペ",
        "XJコンバーチブル",
        "XKクーペ",
        "XKコンバーチブル",
        "Xタイプ",
        "Xタイプエステート",
        "Fタイプクーペ",
        "Fタイプコンバーチブル",
        "Fペース",
        "XE",
        "Eペース"
    ]
    //MORGAN
    const carModelsMorgan = [
        "４／４",
        "プラス４"
    ]
    //ASTON MARTIN
    const carModelsAstonMartin = [
        "DB7",
        "DB7ヴォランテ",
        "DB9",
        "DB9ヴォランテ",
        "DBS",
        "DBSヴォランテ",
        "V12ヴァンキッシュ",
        "V12ヴァンテージ",
        "V8",
        "V8ヴァンテージロードスター",
        "ヴァンテージ",
        "ラピード"
    ]
    //ROLLS ROYCE
    const carModelsRollsRoyce = [
        "コーニッシュ",
        "シルバースパー",
        "シルバースピリット",
        "シルバーセラフ",
        "シルバードーン",
        "パークウォード",
        "ファントム",
        "ファントムドロップヘッドクーペ",
        "ファントムクーペ"
    ]
    //BENTLEY
    const carModelsBentley = [
        "アズール",
        "アルナージ",
        "エイト",
        "コンチネンタル",
        "コンチネンタルGT",
        "コンチネンタルGTC",
        "コンチネンタルクーペ",
        "コンチネンタルコンバーチブル",
        "コンチネンタルスーパースポーツ",
        "ターボ",
        "ブルックランズ",
        "ミュルザンヌ",
        "コンチネンタルGTコンバーチブル",
        "フライングスパー",
        "ベンテイガ"
    ]
    //TVR
    const carModelsTVR = [
        "T350",
        "キミーラ",
        "グリフィス",
        "サーブラウ",
        "サガリス",
        "タスカン",
        "タスカンコンバーチブル",
        "タモーラ"
    ]
    //LOTUS
    const carModelsLotus = [
        "エヴォーラ",
        "エキシージ",
        "エスプリ",
        "エラン",
        "エリーゼ",
        "ヨーロッパ"
    ]
    //DAIMLER
    const carModelsDaimler = [
        "デイムラー"
    ]
    //MG
    const carModelsMG = [
        "Ｆ",
        "ＲＶ８",
        "ＴＦ",
        "ＺＴ",
        "ＺＴ-Ｔ"
    ]
    //CHRYSLER 
    const carModelsChrysler = [
        "300C",
        "300Cツーリング",
        "300M",
        "PTクルーザー",
        "PTクルーザーカブリオ",
        "アクレイム",
        "インペリアル",
        "グランドボイジャー",
        "クロスファイア",
        "クロスファイアロードスター",
        "ストラトス",
        "デイトナ",
        "ニューヨーカー",
        "ネオン",
        "ビジョン",
        "プレミア",
        "ボイジャー",
        "ルバロン",
        "ルバロンコンバーチブル",
        "イプシロン",
        "300"
    ]
    //FORD
    const carModelsFord = [
        "Ka",
        "イクシオン",
        "エクスプローラー",
        "エクスプローラースポーツトラック",
        "エスケープ",
        "ギャラクシー",
        "クーガ",
        "サンダーバード",
        "スペクトロン",
        "テルスター",
        "テルスターII",
        "テルスターTX5",
        "テルスターワゴン",
        "トーラス",
        "トーラスワゴン",
        "フィエスタ",
        "フェスティバ",
        "フェスティバセダン",
        "フェスティバミニワゴン",
        "フォーカス",
        "フォーカスC-MAX",
        "フォーカスワゴン",
        "フリーダ",
        "プローブ",
        "ブロンコ",
        "マスタング",
        "マスタングコンバーチブル",
        "モンデオ",
        "モンデオワゴン",
        "レーザー",
        "レーザーハッチバック",
        "レーザーリデア",
        "レーザーリデアワゴン",
        "J80",
        "J100",
        "エコスポーツ"
    ]
    //JEEP
    const carModelsJeep = [
        "グランドチェロキー",
        "コマンダー",
        "チェロキー",
        "パトリオット",
        "ラングラー",
        "コンパス",
        "レネゲード"
    ]
    //HUMMER
    const carModelsHummer = [
        "Ｈ２",
        "Ｈ３"
    ]
    //SATURN
    const carModelsSaturn = [
        "ＳＣ２",
        "ＳＬ２",
        "ＳＷ２"
    ]
    //CADILLAC
    const carModelsCadillac = [
        "CTS",
        "CTSクーペ",
        "CTSスポーツワゴン",
        "DTS",
        "SRX",
        "SRXクロスオーバー",
        "STS",
        "XLR",
        "アランテ",
        "エスカレード",
        "エルドラド",
        "コンコース",
        "セビル",
        "ドゥビル",
        "フリートウッド",
        "フリートウッドクーペ",
        "ATS",
        "XTS",
        "ATSクーペ",
        "CT6",
        "XT5クロスオーバー"
    ]
    //CHEVROLET
    const carModelsChevrolet = [
        "HHR",
        "MW",
        "S-10ブレイザー",
        "アストロ",
        "エクスプレス",
        "オプトラ",
        "オプトラワゴン",
        "カマロ",
        "カマロコンバーチブル",
        "クルーズ",
        "コルベット",
        "コルベットコンバーチブル",
        "シルバラード",
        "タホ",
        "トラバース",
        "トレイルブレイザー",
        "ブレイザー",
        "キャプティバ",
        "キャプティバ",
        "ソニック"
    ]
    //LINCOLN
    const carModelsLincoln = [
        "LS",
        "MKX",
        "コンチネンタル",
        "タウンカー",
        "ナビゲーター",
        "マークVIII"
    ]
    //MERCURY
    const carModelsMercury = [
        "グランドマーキー",
        "コロニーパーク",
        "セーブル",
        "セーブルワゴン"
    ]
    //BUICK
    const carModelsBuick = [
        "パークアベニュー",
        "リーガル",
        "リーガルクーペ",
        "リーガルワゴン"
    ]
    //DODGE
    const carModelsDodge = [
        "JC",
        "アベンジャー",
        "キャリバー",
        "チャージャー",
        "ナイトロ"
    ]
    //PONTIAC
    const carModelsPontiac = [
        "グランダム",
        "グランダムクーペ",
        "グランプリ",
        "トランザム",
        "ボンネビル"
    ]
    //VOLVO
    const carModelsVolvo = [
        "240",
        "240エステート",
        "480",
        "740",
        "740エステート",
        "760",
        "760エステート",
        "780",
        "850",
        "850エステート",
        "940",
        "940エステート",
        "960",
        "960エステート",
        "C30",
        "C70",
        "C70カブリオレ",
        "S40",
        "S60",
        "S70",
        "S80",
        "S90",
        "V40",
        "V50",
        "V70",
        "V70XC",
        "V90",
        "XC60",
        "XC70",
        "XC90",
        "V60",
        "V40クロスカントリー",
        "V60クロスカントリー",
        "V90クロスカントリー",
        "XC40"
    ]
    //SAAB
    const carModelsSaab = [
        "900",
        "900クーペ",
        "900カブリオレ",
        "9000",
        "9000セダン",
        "9-3",
        "9-3カブリオレ",
        "9-３スポーツエステート",
        "9-3Ｘ",
        "9-5",
        "9-5エステート"
    ]
    //HYUNDAI
    const carModelsHyundai = [
        "i30",
        "i30cw",
        "JM",
        "TB",
        "XG",
        "エラントラ",
        "エラントラセダン",
        "クーペ",
        "グレンジャー",
        "サンタフェ",
        "ソナタ",
        "トラジェ"
    ]
    //DONKERVOORT
    const carModelsDonkerVoort = [
        "D8"
    ]
    //HINO
    const carModelsHino = [
        "レンジャー",
        "dutro",
        "レインボー",
        "プロフィア",
        "リエッセⅡ",
        "リエッセ"
    ]
    //MITSUBISHI FUSO
    const carModelsMitsubishiFuso = [
        "Rosa",
        "Super Great"
    ]
    //NISSAN DIESEL
    const carModelsNissanDiesel = [
        "ビックサム (10-497)"
    ]

    const getMakeFromModel = (model) => {
        const makeToModels = {
            Toyota: carModels,
            Lexus: carModelsLexus,
            Isuzu: carModelsIsuzu,
            Honda: carModelsHonda,
            Nissan: carModelsNissan,
            Mitsubishi: carModelsMitsubishi,
            Mazda: carModelsMazda,
            Subaru: carModelsSubaru,
            Suzuki: carModelsSuzuki,
            Daihatsu: carModelsDaihatsu,
            "Mitsuoka Motor": carModelsMitsuokaMotor,
            "Tommy Kaira": carModelsTommyKaira,
            "Zero Sports": carModelsZeroSports,
            "Mercedes-Benz": carModelsMercedesBenz,
            BMW: carModelsBMW,
            Volkswagen: carModelsVolkswagen,
            Audi: carModelsAudi,
            Mini: carModelsMini,
            Porsche: carModelsPorsche,
            Opel: carModelsOpel,
            Smart: carModelsSmart,
            AMG: carModelsAMG,
            "BMW Alpina": carModelsBMWAlpina,
            Maybach: carModelsMaybach,
            Citroen: carModelsCitroen,
            Peugeot: carModelsPeugeot,
            Renault: carModelsRenault,
            Fiat: carModelsFiat,
            Ferrari: carModelsFerrari,
            Maserati: carModelsMaserati,
            "Alfa Romeo": carModelsAlfaRomeo,
            Lancia: carModelsLancia,
            Lamborghini: carModelsLambo,
            "Land Rover": carModelsLandRover,
            Rover: carModelsRover,
            Jaguar: carModelsJaguar,
            Morgan: carModelsMorgan,
            "Aston Martin": carModelsAstonMartin,
            "Rolls Royce": carModelsRollsRoyce,
            Bentley: carModelsBentley,
            TVR: carModelsTVR,
            Lotus: carModelsLotus,
            Daimler: carModelsDaimler,
            MG: carModelsMG,
            Chrysler: carModelsChrysler,
            Ford: carModelsFord,
            Jeep: carModelsJeep,
            Hummer: carModelsHummer,
            Saturn: carModelsSaturn,
            Cadillac: carModelsCadillac,
            Chevrolet: carModelsChevrolet,
            Lincoln: carModelsLincoln,
            Mercury: carModelsMercury,
            Buick: carModelsBuick,
            Dodge: carModelsDodge,
            Pontiac: carModelsPontiac,
            Volvo: carModelsVolvo,
            Saab: carModelsSaab,
            Hyundai: carModelsHyundai,
            "Donker Voort": carModelsDonkerVoort,
            Hino: carModelsHino,
            "Mitsubishi Fuso": carModelsMitsubishiFuso,
            "Nissan Diesel": carModelsNissanDiesel

        };
        try {
            for (const make in makeToModels) {
                const modelsArray = makeToModels[make];
                if (modelsArray && Array.isArray(modelsArray) && modelsArray.includes(model)) {
                    return make;
                }
            }
            return 'Make not found';
        } catch (error) {
            console.error('Error in getMakeFromModel:', error);
            return 'Error finding make';
        }
    }
    const convertJpDateToGregorian = (jpDate) => {
        const eraStart = {
            "meiji": 1868,
            "taisho": 1912,
            "showa": 1926,
            "heisei": 1989,
            "reiwa": 2019
        };

        const currentYear = 2023;  // Assuming current year is 2023

        if (jpDate.startsWith("H") || jpDate.startsWith("T") || jpDate.startsWith("S") || jpDate.startsWith("R")) {
            const era = jpDate[0].toLowerCase() === "t" ? "taisho" : jpDate[0].toLowerCase() === "s" ? "showa" : jpDate[0].toLowerCase() === "r" ? "reiwa" : "heisei";
            const eraYear = parseInt(jpDate.slice(1, 3), 10);
            const gregorianYear = eraStart[era] + eraYear - 1;

            if (gregorianYear <= currentYear) {
                const month = jpDate.slice(4, 6);
                return `${gregorianYear}/${month}`;
            } else {
                return "Invalid year";
            }
        } else if (jpDate.startsWith("M")) {
            const eraYear = parseInt(jpDate.slice(1, 3), 10);
            const gregorianYear = eraStart["meiji"] + eraYear - 1;

            if (gregorianYear <= currentYear) {
                const month = jpDate.slice(4, 6);
                return `${gregorianYear}/${month}`;
            } else {
                return "Invalid year";
            }
        } else {
            return "Invalid format";
        }
    }

    const automaticChecker = (automatic) => {
        if (automatic === "" || automatic === null || automatic === undefined) {
            return "Automatic";
        } else if (automatic.includes("MT")) {
            return "Manual";
        } else {
            return "Invalid input";
        }
    }
    const mmToCmConverter = (value) => {
        return value / 10;
    }

    const checkOption = (value) => {
        const categories = {
            "comfort": {
                "ComfortAMFMRa": "AM/FM Radio",
                "ComfortAMFMSt": "AM/FM Stereo",
                "ComfortAiCoFr": "A/C:front",
                "ComfortAiCoRe": "A/C:rear",
                "ComfortCDCh": "CD Changer",
                "ComfortCDPl": "CD Player",
                "ComfortCrSpCo": "Cruise Control",
                "ComfortDVDPl": "DVD",
                "ComfortDiSp": "Digital Meter",
                "ComfortHDD": "Hard Disc",
                "ComfortNaSyGPS": "Navigation System",
                "ComfortPoSt": "Power Steering",
                "ComfortPrAuSy": "Premium Sound",
                "ComfortReKeSy": "Remote Keyless Entry",
                "ComfortTiStWh": "Tilt Wheel",
            },
            "exterior": {
                "ExteriorAlWh": "Alloy Wheels",
                "ExteriorPoSlDo": "Power Slide Door",
                "ExteriorSuRo": "Sunroof",
            },
            "interior": {
                "InteriorLeSe": "Leather Seats",
                "InteriorPoDoLo": "Power Door Locks",
                "InteriorPoMi": "Power Mirrors",
                "InteriorPoSe": "Power Seats",
                "InteriorPoWi": "Power Windows",
                "InteriorReWiDe": "Rear Window Defroster",
                "InteriorReWiWi": "Rear Window Wiper",
                "InteriorThRoSe": "Third Row Seats",
                "InteriorTiGl": "Tinted Glass",
            },
            "safetySystem": {
                "SafetySystemAnBrSy": "Anti-Lock Brakes",
                "SafetySystemDrAi": "Driver Airbag",
                "SafetySystemPaAi": "Passenger Airbag",
                "SafetySystemSiAi": "Side Airbag",
            },
            "sellingPoints": {
                "SellingPointsBrNeTi": "New tires",
                "SellingPointsCuWh": "Custom wheels",
                "SellingPointsFuLo": "Fully loaded",
                "SellingPointsMaHiAv": "Maintenance records available",
                "SellingPointsNoAcHi": "No accidents",
                "SellingPointsNoSmPrOw": "Non-smoker",
                "SellingPointsOnOwHi": "One owner",
                "SellingPointsPeRaTi": "Performance tires",
                "SellingPointsReBo": "New paint",
                "SellingPointsTuEn": "Turbo",
                "SellingPointsUpAuSy": "Upgraded sound system"
            }
        };

        let result = {};
        for (let category in categories) {
            result[category] = {};
            for (let key in categories[category]) {
                result[category][key] = value.includes(categories[category][key]);
            }
        }

        return result;
    };
    const checkOptionNew = (value) => {
        const categories = {
            "ComfortAMFMRa": "AM/FM Radio",
            "ComfortAMFMSt": "AM/FM Stereo",
            "ComfortAiCoFr": "A/C:front",
            "ComfortAiCoRe": "A/C:rear",
            "ComfortCDCh": "CD Changer",
            "ComfortCDPl": "CD Player",
            "ComfortCrSpCo": "Cruise Control",
            "ComfortDVDPl": "DVD",
            "ComfortDiSp": "Digital Meter",
            "ComfortHDD": "Hard Disc",
            "ComfortNaSyGPS": "Navigation System",
            "ComfortPoSt": "Power Steering",
            "ComfortPrAuSy": "Premium Sound",
            "ComfortReKeSy": "Remote Keyless Entry",
            "ComfortTiStWh": "Tilt Wheel",
            "ExteriorAlWh": "Alloy Wheels",
            "ExteriorPoSlDo": "Power Slide Door",
            "ExteriorSuRo": "Sunroof",
            "InteriorLeSe": "Leather Seats",
            "InteriorPoDoLo": "Power Door Locks",
            "InteriorPoMi": "Power Mirrors",
            "InteriorPoSe": "Power Seats",
            "InteriorPoWi": "Power Windows",
            "InteriorReWiDe": "Rear Window Defroster",
            "InteriorReWiWi": "Rear Window Wiper",
            "InteriorThRoSe": "Third Row Seats",
            "InteriorTiGl": "Tinted Glass",
            "SafetySystemAnBrSy": "Anti-Lock Brakes",
            "SafetySystemDrAi": "Driver Airbag",
            "SafetySystemPaAi": "Passenger Airbag",
            "SafetySystemSiAi": "Side Airbag",
            "SellingPointsBrNeTi": "New tires",
            "SellingPointsCuWh": "Custom wheels",
            "SellingPointsFuLo": "Fully loaded",
            "SellingPointsMaHiAv": "Maintenance records available",
            "SellingPointsNoAcHi": "No accidents",
            "SellingPointsNoSmPrOw": "Non-smoker",
            "SellingPointsOnOwHi": "One owner",
            "SellingPointsPeRaTi": "Performance tires",
            "SellingPointsReBo": "New paint",
            "SellingPointsTuEn": "Turbo",
            "SellingPointsUpAuSy": "Upgraded sound system"
        };

        let result = {};
        for (let category in categories) {
            result[category] = value.includes(categories[category]) ? true : false;
        }

        return result;
    };
    const checkPort = (value) => {
        const options = {
            "本社": { port: "Nagoya", portID: "N" },
            "HD　みよし": { port: "Nagoya", portID: "N" },
            "輸出(神戸）": { port: "Kobe", portID: "K" },
            "輸出（NZ)": { port: "Nagoya", portID: "N" },
            "輸出（横浜）": { port: "Yokohama", portID: "Y" }, // Removed the extra space here
            "輸出（九州）": { port: "Kyushu", portID: "F" },
            "輸出（本社）": { port: "Nagoya", portID: "N" },
            "輸出（名港）": { port: "Nagoya", portID: "N" },
            "自販の在庫": { port: "Nagoya", portID: "N" },
            "HDﾄﾗｯｸの在庫": { port: "Nagoya", portID: "N" },
            "トラスタ": { port: "Nagoya", portID: "N" },
            "書類入庫": { port: "Nagoya", portID: "N" },
            "代車": { port: "Nagoya", portID: "N" },
            "Zambia Office ": { port: "Nagoya", portID: "N" },
            "NZ Office": { port: "Nagoya", portID: "N" },
            "Tanzania Office": { port: "Nagoya", portID: "N" },
            "社用車": { port: "Nagoya", portID: "N" },
            "豊南自動車": { port: "Nagoya", portID: "N" },
            "本社（AS）": { port: "Nagoya", portID: "N" },
            "本地ﾔｰﾄﾞ（AS）": { port: "Nagoya", portID: "N" },
            "輸出（本社AS）": { port: "Nagoya", portID: "N" },
            "トラック市第1展示場": { port: "Nagoya", portID: "N" },
            "日立ﾘｰｽ": { port: "Nagoya", portID: "N" },
            "ﾘｺｰﾘｰｽ": { port: "Nagoya", portID: "N" },
            "ﾘｺｰﾛｰﾝ": { port: "Nagoya", portID: "N" },
            "三井ﾘｰｽ": { port: "Nagoya", portID: "N" },
            "三井ﾛｰﾝ": { port: "Nagoya", portID: "N" },
            "SMFLﾘｰｽ": { port: "Nagoya", portID: "N" },
            "SMFLﾛｰﾝ": { port: "Nagoya", portID: "N" },
            "RMJ輸出(三利）": { port: "Nagoya", portID: "N" },
            "輸出　Zambia": { port: "Nagoya", portID: "N" },
            "ﾎﾞﾃﾞｨｰ": { port: "Nagoya", portID: "N" },
            "ﾗｼﾞｺﾝ": { port: "Nagoya", portID: "N" },
            "台風　六甲": { port: "Nagoya", portID: "N" },
            "トラック王国": { port: "Nagoya", portID: "N" },
            "HD　明石": { port: "Nagoya", portID: "N" },
            "田代ヤード": { port: "Nagoya", portID: "N" },
            "自販　明石": { port: "Nagoya", portID: "N" },
            "ｵｰｸﾈｯﾄﾔｰﾄﾞ": { port: "Nagoya", portID: "N" },
            "共有ﾄﾗｯｸ・輸出": { port: "Nagoya", portID: "N" },
            "田代　共有": { port: "Nagoya", portID: "N" },
            "償却": { port: "Nagoya", portID: "N" },
            "MIRIVE愛知": { port: "Nagoya", portID: "N" },
            "セントパーツ": { port: "Nagoya", portID: "N" }
        };

        for (let key in options) {
            if (value.includes(key)) {
                return options[key];
            }
        }

        return result;
    };
    const checkBuyer = (value) => {
        const options = {
            "会長": { buyer: "会長", buyerID: "0" },
            "内田社長": { buyer: "内田社長", buyerID: "1" },
            "柳澤副社長": { buyer: "柳澤副社長", buyerID: "2" },
            "花本": { buyer: "花本", buyerID: "3" },
            "東": { buyer: "東", buyerID: "4" },
            "元村拓": { buyer: "元村拓", buyerID: "5" },
            "加藤友康": { buyer: "加藤友康", buyerID: "6" },
            "山崎": { buyer: "山崎", buyerID: "7" },
            "岡村学": { buyer: "岡村学", buyerID: "8" },
            "AS 副社長": { buyer: "AS 副社長", buyerID: "9" },
            "北村祐亮": { buyer: "北村祐亮", buyerID: "10" },
            "志賀": { buyer: "志賀", buyerID: "11" },
            "ピヤパン": { buyer: "ピヤパン", buyerID: "12" },
            "西田幸平": { buyer: "西田幸平", buyerID: "13" },
            "熊澤": { buyer: "熊澤", buyerID: "14" },
            "鈴木": { buyer: "鈴木", buyerID: "15" },
            "川原": { buyer: "川原", buyerID: "16" },
            "松原": { buyer: "松原", buyerID: "17" },
            "柳澤好一郎": { buyer: "柳澤好一郎", buyerID: "18" },
            "植村": { buyer: "植村", buyerID: "19" },
            "ジャスティン": { buyer: "ジャスティン", buyerID: "20" },
            "森川": { buyer: "森川", buyerID: "21" },
            "永井": { buyer: "永井", buyerID: "22" },
            "シェノン": { buyer: "シェノン", buyerID: "23" },
            "新井": { buyer: "新井", buyerID: "24" },
            "佐藤": { buyer: "佐藤", buyerID: "25" },
            "セントパーツ": { buyer: "セントパーツ", buyerID: "26" },
            "自販在庫": { buyer: "自販在庫", buyerID: "90" },
            "ヤナギサワ自販（会長）": { buyer: "ヤナギサワ自販（会長）", buyerID: "28" },
            "伊藤": { buyer: "伊藤", buyerID: "29" },
            "佐藤　清貴": { buyer: "佐藤　清貴", buyerID: "30" },
            "橋本 貴": { buyer: "橋本 貴", buyerID: "31" },
            "AS　 副社長": { buyer: "AS　 副社長", buyerID: "32" },
            "NZ岡村学": { buyer: "NZ岡村学", buyerID: "33" },
            "NZ元村拓": { buyer: "NZ元村拓", buyerID: "34" },
            "NZ内田社長": { buyer: "NZ内田社長", buyerID: "35" },
            "NZ柳澤副社長": { buyer: "NZ柳澤副社長", buyerID: "36" },
            "社用車・代車": { buyer: "社用車・代車", buyerID: "37" },
            "部品取（輸出": { buyer: "部品取（輸出", buyerID: "38" }
        };

        for (let key in options) {
            if (value.includes(key)) {
                return options[key];
            }
        }

        return null;
    };
    const checkSales = (value) => {
        const options = {
            "y.kitamura": { sales: "Yusuke", salesID: "F" },
            "abdi": { sales: "Abdi", salesID: "A" }
        }
        for (let key in options) {
            if (value.includes(key)) {
                return options[key];
            }
        }

        return null;
    };
    const checkFuel = (value) => {
        const options = {
            "ガソリン": "Gasoline/Petrol",
            "ディーゼル": "Diesel",
            "ロータリー": "Rotary",
            "ハイブリッド": "Hybrid",
            "電気": "Electric"
        };

        return options[value] || null;
    };
    function cubicCmToCubicMeters(cubicCm) {
        return (cubicCm / 1000000).toFixed(2);
    }

    console.log('Port options', checkPort('輸出（九州）'));

    console.log('Value options', checkOption('A/C:front'));


    const [data, setData] = useState([]);
    const [uploadedData, setUploadedData] = useState([]);

    const handleUploadFirebase = async () => {
        const result = await DocumentPicker.getDocumentAsync({ type: 'text/csv' });

        if (result.type === 'success') {
            const file = result;

            fetch(file.uri)
                .then(response => response.arrayBuffer())
                .then(buffer => {
                    const uint8Array = new Uint8Array(buffer);
                    const content = iconv.decode(uint8Array, 'SHIFT-JIS');
                    const utf8Content = new TextDecoder('utf-8').decode(new TextEncoder().encode(content));

                    Papa.parse(utf8Content, {
                        header: false,
                        dynamicTyping: true,
                        complete: async function (results) {
                            const uploadDate = new Date();
                            const formattedDate = `${uploadDate.getFullYear()}/${(uploadDate.getMonth() + 1).toString().padStart(2, '0')}/${uploadDate.getDate().toString().padStart(2, '0')} at ${uploadDate.getHours().toString().padStart(2, '0')}:${uploadDate.getMinutes().toString().padStart(2, '0')}:${uploadDate.getSeconds().toString().padStart(2, '0')}`;
                            for (const row of results.data) {
                                // or false depending on your logic


                                let stockId = String(row[0]); // Convert to string
                                if (stockId && typeof stockId === 'string' && stockId.trim() !== "" && stockId !== 'null') {
                                    const uploaded = true;
                                    setUploadedData(prevData => [
                                        ...prevData,
                                        {
                                            stockId, chassisNumber, make, model, uploaded, dateUploaded: formattedDate
                                        }
                                    ]);
                                    // Remove quotes from stockId
                                    stockId = stockId.replace(/["']/g, "");
                                    const model = row[2];
                                    const color = row[4];
                                    const date = row[6];
                                    const bodyTypeJp = row[7];
                                    const modelCode = row[5];
                                    const mileage = String(row[15]);
                                    const dimensionHeightMM = row[18];
                                    const dimensionHeight = mmToCmConverter(dimensionHeightMM).toString();
                                    if (dimensionHeightMM === '高さ ') {
                                        continue; // Skip this row
                                    }
                                    if (stockId && stockId.includes('仕入No.')) {
                                        continue;
                                    }
                                    const dimensionLengthMM = row[16];
                                    const dimensionLength = mmToCmConverter(dimensionLengthMM).toString();
                                    if (dimensionLengthMM === '長さ') {
                                        continue; // Skip this row
                                    }
                                    const dimensionWidthMM = row[17];
                                    const dimensionWidth = mmToCmConverter(dimensionWidthMM).toString();
                                    if (dimensionWidthMM === '幅') {
                                        continue; // Skip this row
                                    }
                                    if (modelCode && modelCode.includes('型式')) {
                                        continue;
                                    }
                                    if (mileage && mileage.includes('走行距離')) {
                                        continue; // Skip this row
                                    }
                                    const engineDisplacement = String(row[8]);
                                    const manualOrAuto = row[9];
                                    const chassisNumber = row[11];
                                    if (color && color.includes('色')) {
                                        continue; // Skip this row
                                    }
                                    if (engineDisplacement && engineDisplacement.includes('排気量')) {
                                        continue; // Skip this row
                                    }
                                    if (chassisNumber && chassisNumber.includes('車台番号')) {
                                        continue; // Skip this row
                                    }
                                    if (bodyType && bodyType.includes('ボディ形状')) {
                                        continue; // Skip this row
                                    }
                                    if (manualOrAuto && manualOrAuto.includes('ミッション')) {
                                        continue; // Skip this row
                                    }
                                    if (date && date.includes('年式')) {
                                        console.log("'年式' found, skipping this row.");
                                        continue; // Skip this row
                                    }
                                    const fuel = checkFuel(row[10]);
                                    console.log('Date:', date);
                                    const bodyType = bodyTypeJp ? translateBodyType(bodyTypeJp).toUpperCase() : '';
                                    const mission = automaticChecker(manualOrAuto);
                                    const [eraYear, month] = date.split('/');
                                    const yearJp = eraYear;
                                    const monthJp = month;
                                    const purchasedPrice = String(row[25]);
                                    const dateConvert = convertJpDateToGregorian(date);
                                    const [convertedEraYear, convertedMonth] = dateConvert.split('/');
                                    const make = getMakeFromModel(
                                        model);
                                    const modelTranslate = translateCarModel(model);
                                    const modelTranslateCapitalized = modelTranslate ? modelTranslate.toUpperCase() : '';
                                    const makeCapitalized = make ? make.toUpperCase() : '';
                                    const 展示場所 = row[34];

                                    const transmissionJp = row[9];
                                    const portInfo = checkPort(row[34]);
                                    const portID = portInfo ? portInfo.portID : null;
                                    const salesInfo = checkSales(row[35]);
                                    const salesID = salesInfo ? salesInfo.salesID : null;
                                    const buyerInfo = checkBuyer(row[22]);
                                    const buyerID = buyerInfo ? buyerInfo.buyerID : null;
                                    const docRef = doc(collection(projectExtensionFirestore, 'VehicleProducts'), stockId);
                                    try {
                                        const carName = `${convertedEraYear} ${makeCapitalized} ${modelTranslateCapitalized}`;
                                        const dimensionCubicMeters = cubicCmToCubicMeters(dimensionLength * dimensionWidth * dimensionHeight);
                                        const referenceNumber = `${portID}${stockId}${salesID}-${buyerID}`;
                                        await setDoc(docRef, {
                                            model: modelTranslateCapitalized,
                                            make: makeCapitalized, stockID: stockId,
                                            yearJp: yearJp, monthJp: monthJp,
                                            regYear: convertedEraYear, regMonth: convertedMonth,
                                            carName: carName,
                                            bodyType: bodyType, transmission: mission,
                                            chassisNumber: chassisNumber,
                                            engineDisplacement: engineDisplacement,
                                            exteriorColor: color,
                                            modelCode: modelCode,
                                            mileage: mileage,
                                            dimensionLength: dimensionLength,
                                            dimensionWidth: dimensionWidth,
                                            dimensionHeight: dimensionHeight,
                                            ...checkOption(row[12]),
                                            ...checkPort(row[34]),
                                            ...checkSales(row[35]),
                                            ...checkBuyer(row[22]),
                                            ...checkOptionNew(row[12]),
                                            location: 展示場所,
                                            steering: "Right",
                                            purchasedPrice: purchasedPrice,
                                            fuel: fuel,
                                            transmissionJp: transmissionJp || "",
                                            dimensionCubicMeters: dimensionCubicMeters,
                                            referenceNumber: referenceNumber,
                                            dateAdded: formattedDate

                                        });
                                        console.log(`Document ${stockId} successfully written!`);
                                    } catch (error) {
                                        console.error(`Error writing document: ${error}`);
                                    }
                                } else {
                                    return;
                                }
                            }

                            Alert.alert('Upload Successful');
                        },
                        error: (error) => {
                            console.error('Error while parsing CSV:', error);
                        }
                    });
                })
                .catch(error => {
                    console.error('Error fetching the file:', error);
                });
        }
    };
    const [carModelCounts, setCarModelCounts] = useState({});
    const carModelCountsArray = Object.entries(carModelCounts).map(([model, count]) => ({ model, count }));

    // Sort the array in descending order based on counts
    const sortedCarModelCountsArray = carModelCountsArray.sort((a, b) => b.count - a.count);

    console.log("Ranked car models:", sortedCarModelCountsArray);
    const iconv = require('iconv-lite');
    const handleFileUpload = async () => {
        try {
            const result = await DocumentPicker.getDocumentAsync({ type: 'application/csv' });

            if (result.type === 'success') {
                const file = result;

                fetch(file.uri)
                    .then(response => response.arrayBuffer())
                    .then(buffer => {
                        const uint8Array = new Uint8Array(buffer);
                        const content = iconv.decode(uint8Array, 'SHIFT-JIS');

                        Papa.parse(content, {
                            header: true,
                            dynamicTyping: true,
                            complete: function (results) {
                                console.log('FINISHED:', results.data);

                                const processedData = results.data.map((item) => {
                                    const model = item.車名;
                                    const make = getMakeFromModel(model);

                                    // Count the translated car model
                                    const translatedModel = translateCarModel(model);
                                    setCarModelCounts(prevCounts => {
                                        return {
                                            ...prevCounts,
                                            [translatedModel]: (prevCounts[translatedModel] || 0) + 1
                                        };
                                    });

                                    return { Model: model, Make: make };
                                });

                                // Update the state with new rowData array
                                setFeatureDataString(prevDataArrays => [...prevDataArrays, processedData]);
                                setData(results.data);
                            },
                            error: (error) => {
                                console.error('Error while parsing CSV:', error);
                            }
                        });
                    })
                    .catch(error => {
                        console.error('Error fetching file:', error);
                    });
            } else {
                console.log('User cancelled the picker');
            }
        } catch (error) {
            console.error('Unable to upload:', error);
        }
    };
    const translateCarModel = (carModel) => {
        let translation;
        switch (carModel) {
            case "bB":
                return "bB";
            case "bBオープンデッキ":
                return "bB Open Deck";
            case "FJクルーザー":
                return "FJ Cruiser";
            case "iQ":
                return "iQ";
            case "ist":
                return "ist";
            case "MR2":
                return "MR2";
            case "MR-S":
                return "MR-S";
            case "MRスパイダー":
                return "MR Spider";
            case "RAV4":
                return "RAV4";
            case "RAV4 EV":
                return "RAV4 EV";
            case "WiLL Vi":
                return "WiLL Vi";
            case "WiLL VS":
                return "WiLL VS";
            case "WiLL サイファ":
                return "WiLL Cypha";
            case "アイシス":
                return "Isis";
            case "アバロン":
                return "Avalon";
            case "アベンシス":
                return "Avensis";
            case "アベンシスワゴン":
                return "Avensis Wagon";
            case "アリオン":
                return "Allion";
            case "アリスト":
                return "Aristo";
            case "アルテッツァ":
                return "Altezza";
            case "アルテッツァジータ":
                return "Altezza Gita";
            case "アルファード":
                return "Alphard";
            case "アルファードハイブリッド":
                return "Alphard Hybrid";
            case "アレックス":
                return "Alex";
            case "イプサム":
                return "Ipsum";
            case "ヴァンガード":
                return "Vanguard";
            case "ウィッシュ":
                return "Wish";
            case "ヴィッツ":
                return "Vitz";
            case "ウィンダム":
                return "Windom";
            case "ヴェルファイア":
                return "Vellfire";
            case "ヴェロッサ":
                return "Verossa";
            case "ヴォクシー":
                return "Voxy";
            case "ヴォルツ":
                return "Voltz";
            case "エスティマ":
                return "Estima";
            case "エスティマエミーナ":
                return "Estima Emina";
            case "エスティマハイブリッド":
                return "Estima Hybrid";
            case "エスティマルシーダ":
                return "Estima Lucida";
            case "オーパ":
                return "Opa";
            case "オーリス":
                return "Auris";
            case "オリジン":
                return "Origin";
            case "ガイア":
                return "Gaia";
            case "カムリ":
                return "Camry";
            case "カムリグラシア":
                return "Camry Gracia";
            case "カムリグラシアワゴン":
                return "Camry Gracia Wagon";
            case "カリーナ":
                return "Carina";
            case "カリーナED":
                return "Carina ED";
            case "カリーナサーフ":
                return "Carina Surf";
            case "カルディナ":
                return "Caldina";
            case "カルディナバン":
                return "Caldina Van";
            case "カレン":
                return "Curren";
            case "カローラ":
                return "Corolla";
            case "カローラFX":
                return "Corolla FX";
            case "カローラII":
                return "Corolla II";
            case "カローラアクシオ":
                return "Corolla Axio";
            case "カローラスパシオ":
                return "Corolla Spacio";
            case "カローラセレス":
                return "Corolla Ceres";
            case "カローラバン":
                return "Corolla Van";
            case "カローラフィールダー":
                return "Corolla Fielder";
            case "カローラランクス":
                return "Corolla Runx";
            case "カローラルミオン":
                return "Corolla Rumion";
            case "カローラレビン":
                return "Corolla Levin";
            case "カローラレビンハッチバック":
                return "Corolla Levin Hatchback";
            case "カローラワゴン":
                return "Corolla Wagon";
            case "キャバリエ":
                return "Cavalier";
            case "キャバリエクーペ":
                return "Cavalier Coupe";
            case "キャミ":
                return "Camry";
            case "クラウンハードトップ":
                return "Crown Hardtop";
            case "クラウンアスリート":
                return "Crown Athlete";
            case "クラウンエステート":
                return "Crown Estate";
            case "クラウンコンフォート":
                return "Crown Comfort";
            case "クラウンセダン":
                return "Crown Sedan";
            case "クラウンハイブリッド":
                return "Crown Hybrid";
            case "クラウンバン":
                return "Crown Van";
            case "クラウンマジェスタ":
                return "Crown Majesta";
            case "クラウンロイヤル":
                return "Crown Royal";
            case "クラウンワゴン":
                return "Crown Wagon";
            case "グラシア":
                return "Gracia";
            case "クラシック":
                return "Classic";
            case "グランドハイエース":
                return "Grand Hiace";
            case "グランビア":
                return "Granvia";
            case "クルーガー":
                return "Kluger";
            case "クルーガーハイブリッド":
                return "Kluger Hybrid";
            case "クレスタ":
                return "Cressida";
            case "コルサ":
                return "Corsa";
            case "コルサセダン":
                return "Corsa Sedan";
            case "コロナ":
                return "Corona";
            case "コロナエクシヴ":
                return "Corona Exiv";
            case "コロナクーペ":
                return "Corona Coupe";
            case "コロナプレミオ":
                return "Corona Premio";
            case "ＳＡＩ":
                return "SAI";
            case "サイノス":
                return "Synos";
            case "サイノスコンバーチブル":
                return "Synos Convertible";
            case "サクシード":
                return "Succeed";
            case "サクシードバン":
                return "Succeed Van";
            case "シエンタ":
                return "Sienta";
            case "スープラ":
                return "Supra";
            case "スターレット":
                return "Starlet";
            case "スパーキー":
                return "Sparky";
            case "スプリンター":
                return "Sprinter";
            case "スプリンターカリブ":
                return "Sprinter Carib";
            case "スプリンターシエロ":
                return "Sprinter Cielo";
            case "スプリンタートレノ":
                return "Sprinter Trueno";
            case "スプリンタートレノハッチバック":
                return "Sprinter Trueno Hatchback";
            case "スプリンターバン":
                return "Sprinter Van";
            case "スプリンターマリノ":
                return "Sprinter Marino";
            case "スプリンターワゴン":
                return "Sprinter Wagon";
            case "セプター":
                return "Scepter";
            case "セプタークーペ":
                return "Scepter Coupe";
            case "セプターワゴン":
                return "Scepter Wagon";
            case "セラ":
                return "Sera";
            case "セリカ":
                return "Celica";
            case "セリカコンバーチブル":
                return "Celica Convertible";
            case "セルシオ":
                return "Celsior";
            case "センチュリー":
                return "Century";
            case "ソアラ":
                return "Soarer";
            case "ソアラエアロキャビン":
                return "Soarer Aero Cabin";
            case "ターセル":
                return "Tercel";
            case "ターセルセダン":
                return "Tercel Sedan";
            case "タウンエース":
                return "TownAce";
            case "タウンエーストラック":
                return "TownAce Truck";
            case "タウンエースノア":
                return "TownAce Noah";
            case "タウンエースノアバン":
                return "TownAce Noah Van";
            case "タウンエースバン":
                return "TownAce Van";
            case "チェイサー":
                return "Chaser";
            case "ツーリングハイエース":
                return "Touring HiAce";
            case "デュエット":
                return "Duet";
            case "ナディア":
                return "Nadia";
            case "ノア":
                return "Noah";
            case "ハイエース":
                return "HiAce";
            case "ハイエースバン":
                return "HiAce Van";
            case "ハイエースレジアス":
                return "HiAce Regius";
            case "ハイラックス":
                return "Hilux";
            case "ハイラックスサーフ":
                return "Hilux Surf";
            case "パッソ":
                return "Passo";
            case "パッソセッテ":
                return "Passo Sette";
            case "ハリアー":
                return "Harrier";
            case "ハリアーハイブリッド":
                return "Harrier Hybrid";
            case "ビスタ":
                return "Vista";
            case "ビスタアルデオ":
                return "Vista Ardeo";
            case "ファンカーゴ":
                return "Funcargo";
            case "プラッツ":
                return "Platz";
            case "プリウス":
                return "Prius";
            case "プリウスEX":
                return "Prius Ex";
            case "ブリザード":
                return "Blizzard";
            case "ブレイド":
                return "Blade";
            case "ブレビス":
                return "Brevis";
            case "プレミオ":
                return "Premio";
            case "プログレ":
                return "Progres";
            case "プロナード":
                return "Pronard";
            case "プロボックス":
                return "Probox";
            case "プロボックスバン":
                return "Probox Van";
            case "ベルタ":
                return "Belta";
            case "ポルテ":
                return "Porte";
            case "マークIIハードトップ":
                return "Mark II Hardtop";
            case "マークIIクオリス":
                return "Mark II Qualis";
            case "マークIIセダン":
                return "Mark II Sedan";
            case "マークIIバン":
                return "Mark II Van";
            case "マークIIブリット":
                return "Mark II Blit";
            case "マークIIワゴン":
                return "Mark II Wagon";
            case "マークX":
                return "Mark X";
            case "マークXジオ":
                return "Mark X Zio";
            case "マスターエースサーフ":
                return "Master Ace Surf";
            case "メガクルーザー":
                return "Mega Cruiser";
            case "ライトエース":
                return "LiteAce";
            case "ライトエーストラック":
                return "LiteAce Truck";
            case "ライトエースノア":
                return "LiteAce Noah";
            case "ライトエースノアバン":
                return "LiteAce Noah Van";
            case "ライトエースバン":
                return "LiteAce Van";
            case "ラウム":
                return "Room";
            case "ラクティス":
                return "Ractis";
            case "ラッシュ":
                return "Rush";
            case "ランドクルーザー60":
                return "Land Cruiser 60";
            case "ランドクルーザー70":
                return "Land Cruiser 70";
            case "ランドクルーザー80":
                return "Land Cruiser 80";
            case "ランドクルーザー100":
                return "Land Cruiser 100";
            case "ランドクルーザー200":
                return "Land Cruiser 200";
            case "ランドクルーザーシグナス":
                return "Land Cruiser Signus";
            case "ランドクルーザープラド":
                return "Land Cruiser Prado";
            case "レジアス":
                return "Regius";
            case "レジアスエース":
                return "Regius Ace";
            case "コロナSF":
                return "Corona SF";
            case "ハイエーストラック":
                return "HiAce Truck";
            case "プリウスアルファ":
                return "Prius Alpha";
            case "コンフォート":
                return "Comfort";
            case "ダイナ":
                return "Dyna";
            case "トヨエース":
                return "ToyoAce";
            case "コースター":
                return "Coaster";
            case "クイックデリバリー":
                return "Quick Delivery";
            case "ヴェルファイアハイブリッド":
                return "Vellfire Hybrid";
            case "カムリハイブリッド":
                return "Camry Hybrid";
            case "ピクシス スペース":
                return "Pixis Space";
            case "アクア":
                return "Aqua";
            case "86":
                return "86";
            case "ピクシス バン":
                return "Pixis Van";
            case "ピクシス トラック":
                return "Pixis Truck";
            case "ピクシス エポック":
                return "Pixis Epoch";
            case "スペード":
                return "Spade";
            case "ノア ハイブリッド":
                return "Noah Hybrid";
            case "ヴォクシー ハイブリッド":
                return "Voxy Hybrid";
            case "エスクァイア":
                return "Esquire";

            case "エスクァイアハイブリッド":
                return "Esquire Hybrid";

            case "ミライ":
                return "Mirai";

            case "ピクシス メガ":
                return "Pixis Mega";

            case "シエンタ ハイブリッド":
                return "Sienta Hybrid";

            case "ピクシス ジョイ":
                return "Pixis Joy";

            case "タンク":
                return "Tank";

            case "ルーミー":
                return "Roomy";

            case "C-HR":
                return "C-HR";

            case "ハイエースコミューター":
                return "Hiace Commuter";

            case "ジャパンタクシー":
                return "Japan Taxi";

            case "グランエース":
                return "GranAce";
            case "ＣＴ":
                return "CT";
            case "ＧＳ":
                return "GS";
            case "ＧＳハイブリッド":
                return "GS Hybrid";
            case "ＨＳ":
                return "HS";
            case "ＩＳ":
                return "IS";
            case "ＩＳ Ｆ":
                return "IS F";
            case "ＩＳコンバーチブル":
                return "IS Convertible";
            case "ＬＳ":
                return "LS";
            case "ＬＳハイブリッド":
                return "LS Hybrid";
            case "ＲＸ":
                return "RX";
            case "ＲＸハイブリッド":
                return "RX Hybrid";
            case "ＳＣ":
                return "SC";
            case "ＬＦＡ":
                return "LFA";
            case "ＩＳハイブリッド":
                return "IS Hybrid";
            case "NXハイブリッド":
                return "NX Hybrid";
            case "RC":
                return "RC";
            case "RCハイブリッド":
                return "RC Hybrid";
            case "RC F":
                return "RC F";
            case "LX":
                return "LX";
            case "GS F":
                return "GS F";
            case "NX":
                return "NX";
            case "LC":
                return "LC";
            case "LCハイブリッド":
                return "LC Hybrid";
            case "PAネロ":
                return "PA Nero";
            case "PAネロハッチバック":
                return "PA Nero Hatchback";
            case "アスカ":
                return "Aska";
            case "アスカCX":
                return "Aska CX";
            case "ウィザード":
                return "Wizard";
            case "ジェミニ":
                return "Gemini";
            case "ジェミニクープ":
                return "Gemini Coupe";
            case "ジェミニハッチバック":
                return "Gemini Hatchback";
            case "ピアッツァ":
                return "Piazza";
            case "ピアッツァネロ":
                return "Piazza Nero";
            case "ビークロス":
                return "BeCross";
            case "ビッグホーン":
                return "Big Horn";
            case "ファーゴ":
                return "Fargo";
            case "ファーゴトラック":
                return "Fargo Truck";
            case "ファーゴバン":
                return "Fargo Van";
            case "ファーゴフィリー":
                return "Fargo Philly";
            case "ファスター":
                return "Faster";
            case "フィリー":
                return "Philly";
            case "ミュー":
                return "Mu";
            case "ミューウィザード":
                return "Mu Wizard";
            case "ロデオ":
                return "Rodeo";
            case "コモ":
                return "Como";
            case "ELF TRUCK":
                return "Elf Truck";
            case "JOURNEY BUS":
                return "Journey Bus";
            case "JUSTON":
                return "Juston";
            case "FORWARD":
                return "Forward";
            case "ギガ":
                return "Giga";
            case "180SX":
                return "180SX";
            case "AD":
                return "AD";
            case "AD-MAXバン":
                return "AD-MAX Van";
            case "AD-MAXワゴン":
                return "AD-MAX Wagon";
            case "ADエキスパート":
                return "AD Expert";
            case "ADバン":
                return "AD Van";
            case "ADワゴン":
                return "AD Wagon";
            case "Be-1":
                return "Be-1";
            case "GT-R":
                return "GT-R";
            case "NV200バネット":
                return "NV200 Vanette";
            case "NV200バネットバン":
                return "NV200 Vanette Van";
            case "NXクーペ":
                return "NX Coupe";
            case "アベニール":
                return "Avenir";
            case "アベニールカーゴ":
                return "Avenir Cargo";
            case "インフィニティQ45":
                return "Infiniti Q45";
            case "ウイングロード":
                return "Wingroad";
            case "エキスパート":
                return "Expert";
            case "エクストレイル":
                return "X-Trail";
            case "エスカルゴ":
                return "Escargot";
            case "エルグランド":
                return "Elgrand";
            case "オッティ":
                return "Otti";
            case "キックス":
                return "Kicks";
            case "キャラバン":
                return "Caravan";
            case "キャラバンコーチ":
                return "Caravan Coach";
            case "キューブ":
                return "Cube";
            case "キューブキュービック":
                return "Cube Cubic";
            case "クエスト":
                return "Quest";
            case "クリッパー":
                return "Clipper";
            case "クリッパートラック":
                return "Clipper Truck";
            case "クリッパーリオ":
                return "Clipper Rio";
            case "クルー":
                return "Crew";
            case "グロリア":
                return "Gloria";
            case "グロリアセダン":
                return "Gloria Sedan";
            case "グロリアバン":
                return "Gloria Van";
            case "グロリアワゴン":
                return "Gloria Wagon";
            case "サニー":
                return "Sunny";
            case "サニーRZ-1":
                return "Sunny RZ-1";
            case "サニーカリフォルニア":
                return "Sunny California";
            case "サファリ":
                return "Safari";
            case "シーマ":
                return "Cima";
            case "ジューク":
                return "Juke";
            case "シルビア":
                return "Silvia";
            case "シルビアヴァリエッタ":
                return "Silvia Varietta";
            case "シルビアコンバーチブル":
                return "Silvia Convertible";
            case "スカイライン":
                return "Skyline";
            case "スカイラインGT-R":
                return "Skyline GT-R";
            case "スカイラインGT-Rセダン":
                return "Skyline GT-R Sedan";
            case "スカイラインクーペ":
                return "Skyline Coupe";
            case "スカイラインクロスオーバー":
                return "Skyline Crossover";
            case "ステージア":
                return "Stagea";
            case "セドリック":
                return "Cedric";
            case "セドリックセダン":
                return "Cedric Sedan";
            case "セドリックバン":
                return "Cedric Van";
            case "セドリックワゴン":
                return "Cedric Wagon";
            case "セフィーロ":
                return "Cefiro";
            case "セフィーロワゴン":
                return "Cefiro Wagon";
            case "セレナ":
                return "Serena";
            case "セレナカーゴ":
                return "Serena Cargo";
            case "ダットサン":
                return "Datsun";
            case "ティアナ":
                return "Teana";
            case "ティーダ":
                return "Tiida";
            case "ティーダラティオ":
                return "Tiida Latio";
            case "ティーノ":
                return "Tino";
            case "デュアリス":
                return "Dualis";
            case "テラノ":
                return "Terrano";
            case "テラノレグラス":
                return "Terrano Regulus";
            case "ノート":
                return "Note";
            case "ハイパーミニ":
                return "Hyper Mini";
            case "パオ":
                return "Pao";
            case "バサラ":
                return "Basara";
            case "バネット":
                return "Vanette";
            case "バネットセレナ":
                return "Vanette Serena";
            case "バネットトラック":
                return "Vanette Truck";
            case "バネットラルゴ":
                return "Vanette Largo";
            case "パルサー":
                return "Pulsar";
            case "パルサーセダン":
                return "Pulsar Sedan";
            case "パルサーセリエ":
                return "Pulsar Serie";
            case "パルサーセリエS-RV":
                return "Pulsar Serie S-RV";
            case "ピノ":
                return "Pino";
            case "フィガロ":
                return "Figaro";
            case "フーガ":
                return "Fuga";
            case "フーガハイブリッド":
                return "Fuga Hybrid";
            case "フェアレディZ":
                return "Fairlady Z";
            case "フェアレディZコンバーチブル":
                return "Fairlady Z Convertible";
            case "フェアレディZロードスター":
                return "Fairlady Z Roadster";
            case "プリメーラ":
                return "Primera";
            case "プリメーラカミノ":
                return "Primera Camino";
            case "プリメーラカミノワゴン":
                return "Primera Camino Wagon";
            case "プリメーラハッチバック":
                return "Primera Hatchback";
            case "プリメーラワゴン":
                return "Primera Wagon";
            case "ブルーバード":
                return "Bluebird";
            case "ブルーバードARX":
                return "Bluebird ARX";
            case "ブルーバードオージィー":
                return "Bluebird Aussie";
            case "ブルーバードシルフィ":
                return "Bluebird Sylphy";
            case "ブルーバードハードトップ":
                return "Bluebird Hardtop";
            case "プレーリージョイ":
                return "Prairie Joy";
            case "プレーリーリバティ":
                return "Prairie Liberty";
            case "プレサージュ":
                return "Presage";
            case "プレジデント":
                return "President";
            case "プレセア":
                return "Presea";
            case "ホーミー":
                return "Homy";
            case "ホーミーコーチ":
                return "Homy Coach";
            case "マーチ":
                return "March";
            case "マーチBOX":
                return "March Box";
            case "マーチカブリオレ":
                return "March Cabriolet";
            case "マイクラCプラスC":
                return "Micra C+C";
            case "マキシマ":
                return "Maxima";
            case "ミストラル":
                return "Mistral";
            case "ムラーノ":
                return "Murano";
            case "モコ":
                return "Moco";
            case "ラシーン":
                return "Lachin";
            case "ラフェスタ":
                return "Lafesta";
            case "ラルゴ":
                return "Largo";
            case "リーフ":
                return "Leaf";
            case "リバティ":
                return "Liberty";
            case "ルークス":
                return "Roox";
            case "ルキノ":
                return "Lucino";
            case "ルキノS-RV":
                return "Lucino S-RV";
            case "ルキノクーペ":
                return "Lucino Coupe";
            case "ルネッサ":
                return "R'nessa";
            case "レパード":
                return "Leopard";
            case "レパードJ.フェリー":
                return "Leopard J. Ferie";
            case "ローレル":
                return "Laurel";
            case "スカイライン２ドアＨＴ":
                return "Skyline 2-Door HT";
            case "パルサーＥＸＡ":
                return "Pulsar EXA";
            case "ブルーバードマキシマ":
                return "Bluebird Maxima";
            case "ブルーバードワゴン":
                return "Bluebird Wagon";
            case "ブルーバードバン":
                return "Bluebird Van";
            case "プレーリー":
                return "Prairie";
            case "ガゼール":
                return "Gazelle";
            case "スタンザ":
                return "Stanza";
            case "チェリー":
                return "Cherry";
            case "オースター":
                return "Ouster";
            case "バイオレット":
                return "Violet";
            case "ローレルスピリット":
                return "Laurel Spirit";
            case "ラングレー":
                return "Langley";
            case "リベルタビラ":
                return "Liberta Villa";
            case "サニートラック":
                return "Sunny Truck";
            case "ラフェスタハイウェイスター":
                return "Lafesta Highway Star";
            case "ラティオ":
                return "Latio";
            case "シルフィ":
                return "Sylphy";
            case "デイズ":
                return "Dayz";
            case "デイズルークス":
                return "Dayz Roox";
            case "スカイライン ハイブリッド":
                return "Skyline Hybrid";
            case "スカイライン ハイブリッド":
                return "Skyline Hybrid";
            case "リベルタビラ":
                return "Liberta Villa";
            case "サニートラック":
                return "Sunny Truck";
            case "NV100クリッパーリオ":
                return "NV100 Clipper Rio";
            case "エクストレイルハイブリッド":
                return "X-Trail Hybrid";
            case "NV150 AD":
                return "NV150 AD";
            case "NV100クリッパー":
                return "NV100 Clipper";
            case "NT100クリッパー":
                return "NT100 Clipper";
            case "シーマハイブリッド":
                return "Cima Hybrid";
            case "NV350キャラバン":
                return "NV350 Caravan";
            case "CIVILIAN BUS":
                return "Civilian Bus";
            case "Atlas":
                return "Atlas";
            case "CIVILIAN":
                return "Civilian";
            case "CONDOR":
                return "Condor";
            case "CR-V":
                return "CR-V";
            case "CR-X":
                return "CR-X";
            case "CR-Xデルソル":
                return "CR-X Del Sol";
            case "CR-Z":
                return "CR-Z";
            case "HR-V":
                return "HR-V";
            case "MDX":
                return "MDX";
            case "NSX":
                return "NSX";
            case "NSX-R":
                return "NSX-R";
            case "S2000":
                return "S2000";
            case "S-MX":
                return "S-MX";
            case "Z":
                return "Z";
            case "アヴァンシア":
                return "Avansia";
            case "アクティトラック":
                return "Acty Truck";
            case "アクティバン":
                return "Acty Van";
            case "アコード":
                return "Accord";
            case "アコードインスパイア":
                return "Accord Inspire";
            case "アコードエアロデッキ":
                return "Accord Aero Deck";
            case "アコードクーペ":
                return "Accord Coupe";
            case "アコードツアラー":
                return "Accord Tourer";
            case "アコードワゴン":
                return "Accord Wagon";
            case "アスコット":
                return "Ascot";
            case "アスコットイノーバ":
                return "Ascot Innova";
            case "インサイト":
                return "Insight";
            case "インスパイア":
                return "Inspire";
            case "インテグラ":
                return "Integra";
            case "インテグラSJ":
                return "Integra SJ";
            case "インテグラセダン":
                return "Integra Sedan";
            case "インテグラタイプR":
                return "Integra Type R";
            case "インテグラタイプRセダン":
                return "Integra Type R Sedan";
            case "エアウェイブ":
                return "Airwave";
            case "エディックス":
                return "Edix";
            case "エリシオン":
                return "Elysion";
            case "エレメント":
                return "Element";
            case "オデッセイ":
                return "Odyssey";
            case "オルティア":
                return "Orthia";
            case "キャパ":
                return "Capa";
            case "クロスロード":
                return "Crossroad";
            case "コンチェルト":
                return "Concerto";
            case "コンチェルトハッチバック":
                return "Concerto Hatchback";
            case "ザッツ":
                return "Zest";
            case "シティ":
                return "City";
            case "シビック":
                return "Civic";
            case "シビッククーペ":
                return "Civic Coupe";
            case "シビックシャトル":
                return "Civic Shuttle";
            case "シビックセダン":
                return "Civic Sedan";
            case "シビックタイプR":
                return "Civic Type R";
            case "シビックタイプRユーロ":
                return "Civic Type R Euro";
            case "シビックハイブリッド":
                return "Civic Hybrid";
            case "シビックフェリオ":
                return "Civic Ferio";
            case "ジャズ":
                return "Jazz";
            case "ステップワゴン":
                return "Stepwgn";
            case "ストリート":
                return "Street";
            case "ストリーム":
                return "Stream";
            case "セイバー":
                return "Saber";
            case "ゼスト":
                return "Zest";
            case "トゥデイ":
                return "Today";
            case "ドマーニ":
                return "Domani";
            case "トルネオ":
                return "Torneo";
            case "パートナー":
                return "Partner";
            case "バモス":
                return "Bamos";
            case "バモスホビオ":
                return "Bamos Hobio";
            case "バモスホビオバン":
                return "Bamos Hobio Van";
            case "ビート":
                return "Beat";
            case "ビガー":
                return "Vigor";
            case "フィット":
                return "Fit";
            case "フィットハイブリッド":
                return "Fit Hybrid";
            case "フィットアリア":
                return "Fit Aria";
            case "フリード":
                return "Freed";
            case "フリードスパイク":
                return "Freed Spike";
            case "プレリュード":
                return "Prelude";
            case "プレリュードインクス":
                return "Prelude INX";
            case "ホライゾン":
                return "Horizon";
            case "モビリオ":
                return "Mobilio";
            case "モビリオスパイク":
                return "Mobilio Spike";
            case "ライフ":
                return "Life";
            case "ラグレイト":
                return "Lagreat";
            case "ラファーガ":
                return "Rafaga";
            case "レジェンド":
                return "Legend";
            case "レジェンドクーペ":
                return "Legend Coupe";
            case "ロゴ":
                return "Logo";
            case "バラードCR-X":
                return "Ballad CR-X";
            case "レジェンドＨＴ":
                return "Legend HT";
            case "バラード":
                return "Ballad";
            case "クイントインテグラ":
                return "Quint Integra";
            case "フィットシャトル":
                return "Fit Shuttle";
            case "フィットシャトルハイブリッド":
                return "Fit Shuttle Hybrid";
            case "フリードハイブリッド":
                return "Freed Hybrid";
            case "フリードスパイクハイブリッド":
                return "Freed Spike Hybrid";
            case "Ｎ ＢＯＸ":
                return "N-Box";
            case "Ｎ ＢＯＸ +":
                return "N-Box +";
            case "N-ONE":
                return "N-ONE";
            case "アコードハイブリッド":
                return "Accord Hybrid";
            case "N-WGN":
                return "N-WGN";
            case "ヴェゼル":
                return "Vezel";
            case "ヴェゼルハイブリッド":
                return "Vezel Hybrid";
            case "レジェンドハイブリッド":
                return "Legend Hybrid";
            case "グレイス":
                return "Grace";
            case "N BOXスラッシュ":
                return "N Box Slash";
            case "ジェイド":
                return "Jade";
            case "S660":
                return "S660";
            case "シャトル":
                return "Shuttle";
            case "シャトルハイブリッド":
                return "Shuttle Hybrid";
            case "クラリティ フューエル セル":
                return "Clarity Fuel Cell";
            case "フリード +":
                return "Freed +";
            case "ekアクティブ":
                return "ek Active";
            case "ekクラッシィ":
                return "ek Classy";
            case "eKスポーツ":
                return "eK Sports";
            case "eKワゴン":
                return "eK Wagon";
            case "FTO":
                return "FTO";
            case "GTO":
                return "GTO";
            case "RVR":
                return "RVR";
            case "アイ":
                return "i";
            case "アイミーブ":
                return "i-MiEV";
            case "アウトランダー":
                return "Outlander";
            case "アスパイア":
                return "Aspire";
            case "エアトレック":
                return "Airtrek";
            case "エクリプス":
                return "Eclipse";
            case "エクリプススパイダー":
                return "Eclipse Spider";
            case "エテルナ":
                return "Eterna";
            case "エテルナサバ":
                return "Eterna Sabb";
            case "エメロード":
                return "Emeraude";
            case "カリスマ":
                return "Carisma";
            case "ギャラン":
                return "Galant";
            case "ギャランスポーツ":
                return "Galant Sports";
            case "ギャランフォルティス":
                return "Galant Fortis";
            case "ギャランフォルティススポーツバック":
                return "Galant Fortis Sportsback";
            case "グランディス":
                return "Grandis";
            case "コルト":
                return "Colt";
            case "コルトプラス":
                return "Colt Plus";
            case "ジープ":
                return "Jeep";
            case "シグマ":
                return "Sigma";
            case "シャリオ":
                return "Chariot";
            case "シャリオグランディス":
                return "Chariot Grandis";
            case "スタリオン":
                return "Starion";
            case "ストラーダ":
                return "Strada";
            case "タウンボックス":
                return "Town Box";
            case "タウンボックスワイド":
                return "Town Box Wide";
            case "チャレンジャー":
                return "Challenger";
            case "ディアマンテ":
                return "Diamante";
            case "ディアマンテワゴン":
                return "Diamante Wagon";
            case "ディオン":
                return "Dion";
            case "ディグニティ":
                return "Dignity";
            case "デボネア":
                return "Debonair";
            case "デリカD：2":
                return "Delica D:2";
            case "デリカD：5":
                return "Delica D:5";
            case "デリカカーゴ":
                return "Delica Cargo";
            case "デリカスターワゴン":
                return "Delica Star Wagon";
            case "デリカスペースギア":
                return "Delica Space Gear";
            case "デリカトラック":
                return "Delica Truck";
            case "デリカバン":
                return "Delica Van";
            case "トッポ":
                return "Toppo";
            case "トッポBJ":
                return "Toppo BJ";
            case "トッポBJワイド":
                return "Toppo BJ Wide";
            case "トライトン":
                return "Triton";
            case "パジェロ":
                return "Pajero";
            case "パジェロイオ":
                return "Pajero iO";
            case "パジェロジュニア":
                return "Pajero Junior";
            case "パジェロミニ":
                return "Pajero Mini";
            case "プラウディア":
                return "Proudia";
            case "ブラボー":
                return "Bravo";
            case "ミニカ":
                return "Minica";
            case "ミニカタウンビー":
                return "Minica Town Bee";
            case "ミニカトッポ":
                return "Minica Toppo";
            case "ミニカトッポタウンビー":
                return "Minica Toppo Town Bee";
            case "ミニキャブトラック":
                return "Minicab Truck";
            case "ミニキャブバン":
                return "Minicab Van";
            case "ミニキャブブラボー":
                return "Minicab Bravo";
            case "ミラージュ":
                return "Mirage";
            case "ミラージュアスティ":
                return "Mirage Asti";
            case "ミラージュセダン":
                return "Mirage Sedan";
            case "ミラージュディンゴ":
                return "Mirage Dingo";
            case "ランサー":
                return "Lancer";
            case "ランサーエボリューション":
                return "Lancer Evolution";
            case "ランサーエボリューションワゴン":
                return "Lancer Evolution Wagon";
            case "ランサーカーゴ":
                return "Lancer Cargo";
            case "ランサーセディア":
                return "Lancer Cedia";
            case "ランサーセディアワゴン":
                return "Lancer Cedia Wagon";
            case "ランサーワゴン":
                return "Lancer Wagon";
            case "リベロカーゴ":
                return "Libero Cargo";
            case "リベロ":
                return "Libero";
            case "レグナム":
                return "Legnum";
            case "ピスタチオ":
                return "Pistachio";
            case "デリカD：3":
                return "Delica D:3";
            case "アウトランダーPHEV":
                return "Outlander PHEV";
            case "キャンター":
                return "Canter";
            case "eKカスタム":
                return "eK Custom";
            case "eKスペース":
                return "eK Space";
            case "eKスペースカスタム":
                return "eK Space Custom";
            case "ミニキャブミーブ トラック":
                return "Minicab Miev Truck";
            case "ミニキャブミーブ":
                return "Minicab Miev";
            case "エクリプスクロス":
                return "Eclipse Cross";
            case "CANTER GUTS":
                return "Canter Guts";
            case "FIGHTER":
                return "Fighter";
            case "FIGHTER MIGNON":
                return "Fighter Mignon";
            case "AZ-1":
                return "AZ-1";
            case "AZ-3":
                return "AZ-3";
            case "AZ-オフロード":
                return "AZ Offroad";
            case "AZ-ワゴン":
                return "AZ Wagon";
            case "CX-7":
                return "CX-7";
            case "MPV":
                return "MPV";
            case "アンフィニMPV":
                return "Efini MPV";
            case "MS-6":
                return "MS-6";
            case "MS-8":
                return "MS-8";
            case "MS-9":
                return "MS-9";
            case "MX-6":
                return "MX-6";
            case "RX-7":
                return "RX-7";
            case "サバンナRX-7":
                return "Savanna RX-7";
            case "アンフィニRX-7":
                return "Efini RX-7";
            case "サバンナRX-7カブリオレ":
                return "Savanna RX-7 Cabriolet";
            case "アクセラ":
                return "Axela";
            case "アクセラスポーツ":
                return "Axela Sport";
            case "アテンザ":
                return "Atenza";
            case "アテンザスポーツ":
                return "Atenza Sport";
            case "アテンザスポーツワゴン":
                return "Atenza Sport Wagon";
            case "カペラ":
                return "Capella";
            case "カペラＣ２":
                return "Capella C2";
            case "カペラＣＧ":
                return "Capella CG";
            case "カペラカーゴ":
                return "Capella Cargo";
            case "カペラワゴン":
                return "Capella Wagon";
            case "キャロル":
                return "Carol";
            case "クレフ":
                return "Clef";
            case "クロノス":
                return "Cronos";
            case "コスモ":
                return "Cosmo";
            case "ユーノスコスモ":
                return "Eunos Cosmo";
            case "スクラムワゴン":
                return "Scrum Wagon";
            case "スクラムトラック":
                return "Scrum Truck";
            case "スピアーノ":
                return "Spiano";
            case "センティア":
                return "Sentia";
            case "デミオ":
                return "Demio";
            case "トリビュート":
                return "Tribute";
            case "ビアンテ":
                return "Biante";
            case "ファミリアアスティナ":
                return "Familia Astina";
            case "ファミリアS-ワゴン":
                return "Familia S-Wagon";
            case "ファミリアNEO":
                return "Familia Neo";
            case "ファミリアビジネスワゴン":
                return "Familia Business Wagon";
            case "ファミリアワゴン":
                return "Familia Wagon";
            case "ファミリアバン":
                return "Familia Van";
            case "ファミリアセダン":
                return "Familia Sedan";
            case "プレマシー":
                return "Premacy";
            case "プロシード":
                return "Proceed";
            case "プロシードマービー":
                return "Proceed Marvie";
            case "プロシードレバンテ":
                return "Proceed Levante";
            case "ベリーサ":
                return "Verisa";
            case "ペルソナ":
                return "Persona";
            case "ボンゴフレンディ":
                return "Bongo Friendee";
            case "ボンゴトラック":
                return "Bongo Truck";
            case "ボンゴバン":
                return "Bongo Van";
            case "ボンゴワゴン":
                return "Bongo Wagon";
            case "ボンゴブローニイトラック":
                return "Bongo Brawny Truck";
            case "ボンゴブローニイバン":
                return "Bongo Brawny Van";
            case "ボンゴブローニイワゴン":
                return "Bongo Brawny Wagon";
            case "ミレーニア":
                return "Millenia";
            case "ユーノス100":
                return "Eunos 100";
            case "ユーノス300":
                return "Eunos 300";
            case "ユーノス500":
                return "Eunos 500";
            case "ユーノス800":
                return "Eunos 800";
            case "ユーノスカーゴ":
                return "Eunos Cargo";
            case "ユーノスプレッソ":
                return "Eunos Presso";
            case "ラピュタ":
                return "Laputa";
            case "ランティス":
                return "Lantis";
            case "ランティスクーペ":
                return "Lantis Coupe";
            case "ルーチェ":
                return "Luce";
            case "レビュー":
                return "Revue";
            case "ロードスター":
                return "Roadster";
            case "ユーノスロードスター":
                return "Eunos Roadster";
            case "ロードスタークーペ":
                return "Roadster Coupe";
            case "ファミリアハッチバック":
                return "Familia Hatchback";
            case "ファミリアカブリオレ":
                return "Familia Cabriolet";
            case "エチュード":
                return "Etude";
            case "カスタムキャブ":
                return "Custom Cab";
            case "RX-8":
                return "RX-8";
            case "スクラムバン":
                return "Scrum Van";
            case "カペラバン":
                return "Capella Van";
            case "タイタン":
                return "Titan";
            case "CX-5":
                return "CX-5";
            case "フレアワゴン":
                return "Flair Wagon";
            case "フレア":
                return "Flair";
            case "フレアクロスオーバー":
                return "Flair Crossover";
            case "アクセラハイブリッド":
                return "Axela Hybrid";
            case "アテンザワゴン":
                return "Atenza Wagon";
            case "CX-3":
                return "CX-3";
            case "ロードスターRF":
                return "Roadster RF";
            case "CX-8":
                return "CX-8";
            case "R1":
                return "R1";
            case "R2":
                return "R2";
            case "アルシオーネ":
                return "Alcyone";
            case "アルシオーネSVX":
                return "Alcyone SVX";
            case "インプレッサ":
                return "Impreza";
            case "インプレッサSTI":
                return "Impreza STI";
            case "インプレッサXV":
                return "Impreza XV";
            case "インプレッサアネシス":
                return "Impreza Anesis";
            case "インプレッサクーペ":
                return "Impreza Coupe";
            case "インプレッサスポーツワゴン":
                return "Impreza Sports Wagon";
            case "インプレッサスポーツワゴンSTI":
                return "Impreza Sports Wagon STI";
            case "インプレッサハッチバック":
                return "Impreza Hatchback";
            case "インプレッサハッチバックSTI":
                return "Impreza Hatchback STI";
            case "ヴィヴィオ":
                return "Vivio";
            case "ヴィヴィオタルガトップ":
                return "Vivio Targa Top";
            case "ヴィヴィオビストロ":
                return "Vivio Bistro";
            case "エクシーガ":
                return "Exiga";
            case "サンバー":
                return "Sambar";
            case "サンバーディアスバン":
                return "Sambar Dias Van";
            case "サンバーディアスワゴン":
                return "Sambar Dias Wagon";
            case "サンバートラック":
                return "Sambar Truck";
            case "ジャスティ":
                return "Justy";
            case "ステラ":
                return "Stella";
            case "ディアスワゴン":
                return "Dias Wagon";
            case "デックス":
                return "Dex";
            case "ドミンゴ":
                return "Domingo";
            case "トラヴィック":
                return "Traviq";
            case "トレジア":
                return "Trezia";
            case "フォレスター":
                return "Forester";
            case "プレオ":
                return "Pleo";
            case "ルクラ":
                return "Lucra";
            case "レガシィB4":
                return "Legacy B4";
            case "レガシィアウトバック":
                return "Legacy Outback";
            case "レガシィグランドワゴン":
                return "Legacy Grand Wagon";
            case "レガシィセダン":
                return "Legacy Sedan";
            case "レガシィツーリングワゴン":
                return "Legacy Touring Wagon";
            case "レガシィランカスター":
                return "Legacy Lancaster";
            case "レックス":
                return "Rex";
            case "レオーネ":
                return "Leone";
            case "レオーネ クーペ":
                return "Leone Coupe";
            case "レオーネ ワゴン":
                return "Leone Wagon";
            case "レオーネ バン":
                return "Leone Van";
            case "BRZ":
                return "BRZ";
            case "ＷＲＸＳＴＩ ハッチバック":
                return "WRX STI Hatchback";
            case "プレオプラス":
                return "Pleo Plus";
            case "インプレッサXV ハイブリッド":
                return "Impreza XV Hybrid";
            case "レヴォーグ":
                return "Levorg";
            case "インプレッサXV":
                return "Impreza XV";
            case "インプレッサスポーツ":
                return "Impreza Sports";
            case "インプレッサG4":
                return "Impreza G4";
            case "WRXSTI":
                return "WRX STI";
            case "WRXS4":
                return "WRX S4";
            case "エクシーガ クロスオーバー7":
                return "Exiga Crossover 7";
            case "シフォン":
                return "Cifon";
            case "レヴォーグ":
                return "Levorg";
            case "Kei":
                return "Kei";
            case "MRワゴン":
                return "MR Wagon";
            case "SX4":
                return "SX4";
            case "SX4セダン":
                return "SX4 Sedan";
            case "X-90":
                return "X-90";
            case "アルト":
                return "Alto";
            case "アルトラパン":
                return "Alto Lapin";
            case "アルトワークス":
                return "Alto Works";
            case "エスクード":
                return "Escudo";
            case "エブリイ":
                return "Every";
            case "エブリイプラス":
                return "Every Plus";
            case "エブリイランディ":
                return "Every Landy";
            case "エブリイワゴン":
                return "Every Wagon";
            case "エリオ":
                return "Erio";
            case "エリオセダン":
                return "Erio Sedan";
            case "カプチーノ":
                return "Cappuccino";
            case "カルタス":
                return "Cultus";
            case "カルタスエスティーム":
                return "Cultus Esteem";
            case "カルタスクレセント":
                return "Cultus Crescent";
            case "カルタスクレセントセダン":
                return "Cultus Crescent Sedan";
            case "カルタスクレセントワゴン":
                return "Cultus Crescent Wagon";
            case "カルタスコンバーチブル":
                return "Cultus Convertible";
            case "カルタスセダン":
                return "Cultus Sedan";
            case "カルタスワゴン":
                return "Cultus Wagon";
            case "キザシ":
                return "Kizashi";
            case "キャラ":
                return "Chara";
            case "キャリイ":
                return "Carry";
            case "キャリイバン":
                return "Carry Van";
            case "グランドエスクード":
                return "Grand Escudo";
            case "ジムニー":
                return "Jimny";
            case "ジムニーシエラ":
                return "Jimny Sierra";
            case "ジムニーワイド":
                return "Jimny Wide";
            case "スイフト":
                return "Swift";
            case "スプラッシュ":
                return "Splash";
            case "セルボ":
                return "Cervo";
            case "セルボモード":
                return "Cervo Mode";
            case "ソリオ":
                return "Solio";
            case "ツイン":
                return "Twin";
            case "パレット":
                return "Palette";
            case "ランディ":
                return "Landy";
            case "ワゴンR":
                return "Wagon R";
            case "ワゴンRソリオ":
                return "Wagon R Solio";
            case "ワゴンRプラス":
                return "Wagon R Plus";
            case "ワゴンRワイド":
                return "Wagon R Wide";
            case "アルト エコ":
                return "Alto Eco";
            case "スペーシア":
                return "Spacia";
            case "ハスラー":
                return "Hustler";
            case "SX4 S-CROSS":
                return "SX4 S-CROSS";
            case "イグニス":
                return "Ignis";
            case "バレーノ":
                return "Baleno";
            case "クロスビー":
                return "Crossby";
            case "MAX":
                return "MAX";
            case "YRV":
                return "YRV";
            case "アトレー":
                return "Atre";
            case "アトレー7":
                return "Atre 7";
            case "アトレーワゴン":
                return "Atre Wagon";
            case "アプローズ":
                return "Applause";
            case "アルティス":
                return "Altis";
            case "エッセ":
                return "Esse";
            case "オプティ":
                return "Opti";
            case "クー":
                return "Coo";
            case "コペン":
                return "Copen";
            case "シャレード":
                return "Charade";
            case "シャレードソシアル":
                return "Charade Social";
            case "ストーリア":
                return "Storia";
            case "ソニカ":
                return "Sonica";
            case "タント":
                return "Tanto";
            case "タントエグゼ":
                return "Tanto Exe";
            case "テリオス":
                return "Terios";
            case "テリオスキッド":
                return "Terios Kid";
            case "テリオスルキア":
                return "Terios Lucía";
            case "デルタトラック":
                return "Delta Truck";
            case "デルタバン":
                return "Delta Van";
            case "デルタルートバン":
                return "Delta Route Van";
            case "デルタワイドバン":
                return "Delta Wide Van";
            case "デルタワイドワゴン":
                return "Delta Wide Wagon";
            case "デルタワゴン":
                return "Delta Wagon";
            case "ネイキッド":
                return "Naked";
            case "パイザー":
                return "Piazza";
            case "ハイゼットカーゴ":
                return "Hijet Cargo";
            case "ハイゼットカーゴハイブリッド":
                return "Hijet Cargo Hybrid";
            case "ハイゼットグランカーゴ":
                return "Hijet Grand Cargo";
            case "ハイゼットトラック":
                return "Hijet Truck";
            case "ハイゼットバン":
                return "Hijet Van";
            case "ハイゼットピック":
                return "Hijet Pick";
            case "ビーゴ":
                return "Be-go";
            case "ブーン":
                return "Boon";
            case "ブーンルミナス":
                return "Boon Luminas";
            case "ミゼットII":
                return "Midget II";
            case "ミラ":
                return "Mira";
            case "ミラアヴィ":
                return "Mira Avy";
            case "ミラココア":
                return "Mira Cocoa";
            case "ミラジーノ":
                return "Mira Gino";
            case "ミラジーノ1000":
                return "Mira Gino 1000";
            case "ムーヴ":
                return "Move";
            case "ムーヴコンテ":
                return "Move Conte";
            case "ムーヴラテ":
                return "Move Latte";
            case "ラガー":
                return "Ragar";
            case "リーザ":
                return "Leeza";
            case "リーザスパイダー":
                return "Leeza Spider";
            case "ロッキー":
                return "Rocky";
            case "ミライース":
                return "Mira e:S";
            case "アルティスハイブリッド":
                return "Altis Hybrid";
            case "メビウス":
                return "Mevious";
            case "ウェイク":
                return "Wake";
            case "キャスト":
                return "Cast";
            case "ハイゼットキャディー":
                return "Hijet Caddy";
            case "ムーヴキャンバス":
                return "Move Canvas";
            case "トール":
                return "Thor";
            case "オロチ":
                return "Orochi";
            case "ガリュー":
                return "Garyu";
            case "ガリュー204":
                return "Garyu 204";
            case "ガリューI":
                return "Garyu I";
            case "ガリューII":
                return "Garyu II";
            case "ガリューIII":
                return "Garyu III";
            case "ガリュークラシック":
                return "Garyu Classic";
            case "ガリューコンバーチブル":
                return "Garyu Convertible";
            case "ガリューリムジンS50":
                return "Garyu Limousine S50";
            case "ゼロ1":
                return "Zero1";
            case "ヌエラ":
                return "Nuera";
            case "ヌエラ6-02":
                return "Nuera 6-02";
            case "ヌエラ6-02ワゴン":
                return "Nuera 6-02 Wagon";
            case "ヒミコ":
                return "Himiko";
            case "ビュート":
                return "Beute";
            case "ユーガ":
                return "Yuga";
            case "ライク":
                return "Like";
            case "ラ・セード":
                return "La Ceide";
            case "リョーガ":
                return "Ryoga";
            case "リョーガワゴン":
                return "Ryoga Wagon";
            case "レイ":
                return "Rei";
            case "リューギ":
                return "Ryugi";
            case "ZZ":
                return "ZZ";
            case "ゼロＥＶエレクシードＲＳ":
                return "Zero EV ELECSEED RS";
            case "190クラス":
                return "190 Class";
            case "Aクラス":
                return "A-Class";
            case "Bクラス":
                return "B-Class";
            case "CLKクラス":
                return "CLK-Class";
            case "CLKクラスカブリオレ":
                return "CLK Class Cabriolet";
            case "CLSクラス":
                return "CLS-Class";
            case "CLクラス":
                return "CL-Class";
            case "Cクラス":
                return "C-Class";
            case "Cクラススポーツクーペ":
                return "C Class Sports Coupe";
            case "Cクラスワゴン":
                return "C Class Wagon";
            case "Eクラス":
                return "E Class";
            case "Eクラスカブリオレ":
                return "E Class Cabriolet";
            case "Eクラスクーペ":
                return "E Class Coupe";
            case "Eクラスワゴン":
                return "E Class Wagon";
            case "GLKクラス":
                return "GLK Class";
            case "GLクラス":
                return "GL Class";
            case "Gクラス":
                return "G Class";
            case "Mクラス":
                return "M Class";
            case "Rクラス":
                return "R Class";
            case "SLKクラス":
                return "SLK Class";
            case "SLRクラス マクラーレン":
                return "SLR Class McLaren";
            case "SLRクラス マクラーレン ロードスター":
                return "SLR Class McLaren Roadster";
            case "SLクラス":
                return "SL Class";
            case "Sクラス":
                return "S Class";
            case "Sクラスクーペ":
                return "S Class Coupe";
            case "Vクラス":
                return "V Class";
            case "バネオ":
                return "Vaneo";
            case "ビアノ":
                return "Viano";
            case "ミディアムクラス":
                return "Medium Class";
            case "ミディアムクラスカブリオレ":
                return "Medium Class Cabriolet";
            case "ミディアムクラスクーペ":
                return "Medium Class Coupe";
            case "ミディアムクラスワゴン/Tシリーズ":
                return "Medium Class Wagon/T Series";
            case "Cクラスクーペ":
                return "C Class Coupe";
            case "CLSクラスシューティングブレーク":
                return "CLS Class Shooting Brake";
            case "CLAクラス":
                return "CLA Class";
            case "SLSクラス":
                return "SLS Class";
            case "GLAクラス":
                return "GLA Class";
            case "CLAクラスシューティングブレーク":
                return "CLA Class Shooting Brake";
            case "Cクラスカブリオレ":
                return "C Class Cabriolet";
            case "GLCクラス":
                return "GLC Class";
            case "GLCクラスクーペ":
                return "GLC Class Coupe";
            case "GLEクラス":
                return "GLE Class";
            case "GLEクラスクーペ":
                return "GLE Class Coupe";
            case "GLSクラス":
                return "GLS Class";
            case "SLCクラス":
                return "SLC Class";
            case "Sクラスカブリオレ":
                return "S Class Cabriolet";
            case "1シリーズ":
                return "1 Series";
            case "1シリーズカブリオレ":
                return "1 Series Convertible";
            case "1シリーズクーペ":
                return "1 Series Coupe";
            case "3シリーズ":
                return "3 Series";
            case "3シリーズカブリオレ":
                return "3 Series Convertible";
            case "3シリーズクーペ":
                return "3 Series Coupe";
            case "3シリーズコンパクト":
                return "3 Series Compact";
            case "3シリーズツーリング":
                return "3 Series Touring";
            case "5シリーズ":
                return "5 Series";
            case "5シリーズグランツーリスモ":
                return "5 Series Gran Turismo";
            case "5シリーズツーリング":
                return "5 Series Touring";
            case "6シリーズ":
                return "6 Series";
            case "6シリーズカブリオレ":
                return "6 Series Convertible";
            case "7シリーズ":
                return "7 Series";
            case "8シリーズ":
                return "8 Series";
            case "M3":
                return "M3";
            case "M3セダン":
                return "M3 Sedan";
            case "M5":
                return "M5";
            case "M6":
                return "M6";
            case "M6 カブリオレ":
                return "M6 Convertible";
            case "X1":
                return "X1";
            case "X3":
                return "X3";
            case "X5":
                return "X5";
            case "X5 M":
                return "X5 M";
            case "X6":
                return "X6";
            case "X6 M":
                return "X6 M";
            case "Z3":
                return "Z3";
            case "Z3 Mクーペ":
                return "Z3 M Coupe";
            case "Z3 Mロードスター":
                return "Z3 M Roadster";
            case "Z3クーペ":
                return "Z3 Coupe";
            case "Z4":
                return "Z4";
            case "Z4 Mクーペ":
                return "Z4 M Coupe";
            case "Z4 Mロードスター":
                return "Z4 M Roadster";
            case "Z4クーペ":
                return "Z4 Coupe";
            case "Z8":
                return "Z8";
            case "6シリーズ グランクーペ":
                return "6 Series Gran Coupe";
            case "M6 グランクーペ":
                return "M6 Gran Coupe";
            case "3シリーズ グランツーリスモ":
                return "3 Series Gran Turismo";
            case "４シリーズ":
                return "4 Series";
            case "M1":
                return "M1";
            case "2シリーズ":
                return "2 Series";
            case "M2":
                return "M2";
            case "i3":
                return "i3";
            case "i8":
                return "i8";
            case "4シリーズグランクーペ":
                return "4 Series Gran Coupe";
            case "4シリーズカブリオレ":
                return "4 Series Convertible";
            case "M4":
                return "M4";
            case "2シリーズ アクティブツアラー":
                return "2 Series Active Tourer";
            case "X4":
                return "X4";
            case "2シリーズカブリオレ":
                return "2 Series Convertible";
            case "2シリーズグランツアラー":
                return "2 Series Gran Tourer";
            case "6シリーズ グランツーリスモ":
                return "6 Series Gran Turismo";
            case "X2":
                return "X2";
            case "イオス":
                return "Eos";
            case "ヴァナゴン":
                return "Vanagon";
            case "ヴェント":
                return "Vento";
            case "クロスゴルフ":
                return "CrossGolf";
            case "クロスポロ":
                return "CrossPolo";
            case "コラード":
                return "Jetta";
            case "ゴルフ":
                return "Golf";
            case "ゴルフヴァリアント":
                return "Golf Variant";
            case "ゴルフカブリオ":
                return "Golf Cabrio";
            case "ゴルフトゥーラン":
                return "Golf Touran";
            case "ゴルフプラス":
                return "Golf Plus";
            case "ゴルフワゴン":
                return "Golf Wagon";
            case "サンタナ":
                return "Santana";
            case "ジェッタ":
                return "Jetta";
            case "シャラン":
                return "Sharan";
            case "シロッコ":
                return "Scirocco";
            case "ティグアン":
                return "Tiguan";
            case "トゥアレグ":
                return "Touareg";
            case "ニュービートル":
                return "New Beetle";
            case "ニュービートルカブリオレ":
                return "New Beetle Cabrio";
            case "パサート":
                return "Passat";
            case "パサートCC":
                return "Passat CC";
            case "パサートバリアント":
                return "Passat Variant";
            case "パサートワゴン":
                return "Passat Wagon";
            case "ボーラ":
                return "Bora";
            case "ポロ":
                return "Polo";
            case "ルポ":
                return "Lupo";
            case "ザ・ビートル":
                return "The Beetle";
            case "アップ！":
                return "Up!";
            case "パサートオールトラック":
                return "Passat Alltrack";
            case "フォルクスワーゲンＣＣ":
                return "Volkswagen CC";
            case "ザ・ビートルカブリオレ":
                return "The Beetle Cabriolet";
            case "ゴルフオールトラック":
                return "Golf Alltrack";
            case "アルテオン":
                return "Arteon";
            case "e-ゴルフ":
                return "e-Golf";
            case "e-アップ!":
                return "e-Up!";
            case "100":
                return "100";
            case "100アバント":
                return "100 Avant";
            case "80":
                return "80";
            case "80アバント":
                return "80 Avant";
            case "90":
                return "90";
            case "A1":
                return "A1";
            case "A3":
                return "A3";
            case "A3スポーツバック":
                return "A3 Sportback";
            case "A4":
                return "A4";
            case "A4アバント":
                return "A4 Avant";
            case "A4オールロードクワトロ":
                return "A4 allroad quattro";
            case "A4カブリオレ":
                return "A4 Cabriolet";
            case "A5":
                return "A5";
            case "A5カブリオレ":
                return "A5 Cabriolet";
            case "A5スポーツバック":
                return "A5 Sportback";
            case "A6":
                return "A6";
            case "A6アバント":
                return "A6 Avant";
            case "A6オールロードクワトロ":
                return "A6 allroad quattro";
            case "A8":
                return "A8";
            case "Q5":
                return "Q5";
            case "Q7":
                return "Q7";
            case "R8":
                return "R8";
            case "R8スパイダー":
                return "R8 Spyder";
            case "RS4":
                return "RS4";
            case "RS4アバント":
                return "RS4 Avant";
            case "RS5":
                return "RS5";
            case "RS6":
                return "RS6";
            case "RS6アバント":
                return "RS6 Avant";
            case "S3":
                return "S3";
            case "S3スポーツバック":
                return "S3 Sportback";
            case "S4":
                return "S4";
            case "S4アバント":
                return "S4 Avant";
            case "S5":
                return "S5";
            case "S5カブリオレ":
                return "S5 Cabriolet";
            case "S6":
                return "S6";
            case "S6アバント":
                return "S6 Avant";
            case "S8":
                return "S8";
            case "TT":
                return "TT";
            case "TTSクーペ":
                return "TTS Coupe";
            case "TTロードスター":
                return "TT Roadster";
            case "TT RSクーペ":
                return "TT RS Coupe";
            case "V8":
                return "V8";
            case "アウディカブリオレ":
                return "Audi Cabriolet";
            case "アウディクーペ":
                return "Audi Coupe";
            case "オールロードクワトロ":
                return "allroad quattro";
            case "Ａ７スポーツバック":
                return "A7 Sportback";
            case "S5スポーツバック":
                return "S5 Sportback";
            case "A1スポーツバック":
                return "A1 Sportback";
            case "Q3":
                return "Q3";
            case "S7スポーツバック":
                return "S7 Sportback";
            case "Q5ハイブリッド":
                return "Q5 Hybrid";
            case "A8ハイブリッド":
                return "A8 Hybrid";
            case "TT RSﾌﾟﾗｽクーペ":
                return "TT RS plus Coupe";
            case "RS5カブリオレ":
                return "RS5 Cabriolet";
            case "SQ5":
                return "SQ5";
            case "Ａ３セダン":
                return "A3 Sedan";
            case "Ｓ３セダン":
                return "S3 Sedan";
            case "ＲＳ７スポーツバック":
                return "RS7 Sportback";
            case "S1":
                return "S1";
            case "S1スポーツバック":
                return "S1 Sportback";
            case "S3セダン":
                return "S3 Sedan";
            case "RS3スポーツバック":
                return "RS3 Sportback";
            case "RSQ3":
                return "RSQ3";
            case "S8プラス":
                return "S8 Plus";
            case "Q2":
                return "Q2";
            case "TT RSロードスター":
                return "TT RS Roadster";
            case "ミニ":
                return "Mini";
            case "ミニクラブマン":
                return "Mini Clubman";
            case "ミニクロスオーバー":
                return "Mini Crossover";
            case "ミニコンバーチブル":
                return "Mini Convertible";
            case "ミニクーペ":
                return "Mini Coupe";
            case "ミニロードスター":
                return "Mini Roadster";
            case "ミニペースマン":
                return "Mini Paceman";
            case "911":
                return "911";
            case "911カブリオレ":
                return "911 Cabriolet";
            case "928":
                return "928";
            case "968":
                return "968";
            case "968カブリオレ":
                return "968 Cabriolet";
            case "カイエン":
                return "Cayenne";
            case "ケイマン":
                return "Cayman";
            case "パナメーラ":
                return "Panamera";
            case "ボクスター":
                return "Boxster";
            case "マカン":
                return "Macan";
            case "718":
                return "718";
            case "アストラ":
                return "Astra";
            case "アストラカブリオ":
                return "Astra Cabrio";
            case "アストラクーペ":
                return "Astra Coupe";
            case "アストラセダン":
                return "Astra Sedan";
            case "アストラワゴン":
                return "Astra Wagon";
            case "ヴィータ":
                return "Vita";
            case "オメガ":
                return "Omega";
            case "オメガワゴン":
                return "Omega Wagon";
            case "カリブラ":
                return "Calibra";
            case "ザフィーラ":
                return "Zafira";
            case "シグナム":
                return "Signum";
            case "スピードスター":
                return "Speedster";
            case "セネター":
                return "Senator";
            case "ティグラ":
                return "Tigra";
            case "ベクトラ":
                return "Vectra";
            case "ベクトラGTS":
                return "Vectra GTS";
            case "ベクトラワゴン":
                return "Vectra Wagon";
            case "メリーバ":
                return "Meriva";
            case "K":
                return "K";
            case "カブリオ":
                return "Cabrio";
            case "クーペ":
                return "Coupe";
            case "クロスブレード":
                return "Crossblade";
            case "フォーツーK":
                return "ForTwo K";
            case "フォーツーカブリオ":
                return "ForTwo Cabrio";
            case "フォーツークーペ":
                return "ForTwo Coupe";
            case "フォーフォー":
                return "ForFour";
            case "ロードスター":
                return "Roadster";
            case "ロードスタークーペ":
                return "Roadster Coupe";
            case "フォーツーエレクトリックドライブ":
                return "ForTwo Electric Drive";
            case "CLKクラス":
                return "CLK Class";
            case "CLKクラスカブリオレ":
                return "CLK Class Cabriolet";
            case "CLSクラス":
                return "CLS Class";
            case "CLクラス":
                return "CL Class";
            case "Cクラス":
                return "C Class";
            case "Cクラスワゴン":
                return "C Class Wagon";
            case "Eクラス":
                return "E Class";
            case "Eクラスワゴン":
                return "E Class Wagon";
            case "Gクラス":
                return "G Class";
            case "Mクラス":
                return "M Class";
            case "Rクラス":
                return "R Class";
            case "SLKクラス":
                return "SLK Class";
            case "SLクラス":
                return "SL Class";
            case "SLSクラス":
                return "SLS Class";
            case "Sクラス":
                return "S Class";
            case "Sクラスクーペ":
                return "S Class Coupe";
            case "Cクラスクーペ":
                return "C Class Coupe";
            case "MLクラス":
                return "ML Class";
            case "Aクラス":
                return "A Class";
            case "CLAクラス":
                return "CLA Class";
            case "CLSクラスシューティングブレーク":
                return "CLS Class Shooting Brake";
            case "GLAクラス":
                return "GLA Class";
            case "CLAクラスシューティングブレーク":
                return "CLA Class Shooting Brake";
            case "GLクラス":
                return "GL Class";
            case "GTクラス":
                return "GT Class";
            case "Cクラスカブリオレ":
                return "C Class Cabriolet";
            case "GLCクラス":
                return "GLC Class";
            case "GLCクラスクーペ":
                return "GLC Class Coupe";
            case "GLEクラス":
                return "GLE Class";
            case "GLEクラスクーペ":
                return "GLE Class Coupe";
            case "SLCクラス":
                return "SLC Class";
            case "Sクラスカブリオレ":
                return "S Class Cabriolet";
            case "GLSクラス":
                return "GLS Class";
            case "DB7": return "DB7"; case "DB7ヴォランテ": return "DB7 Volante"; case "DB9": return "DB9"; case "DB9ヴォランテ": return "DB9 Volante"; case "DBS": return "DBS"; case "DBSヴォランテ": return "DBS Volante"; case "V12ヴァンキッシュ": return "V12 Vanquish"; case "V12ヴァンテージ": return "V12 Vantage"; case "V8": return "V8"; case "V8ヴァンテージロードスター": return "V8 Vantage Roadster"; case "ヴァンテージ": return "Vantage"; case "ラピード": return "Rapide";
            case "コーニッシュ": return "Corniche"; case "シルバースパー": return "Silver Spur"; case "シルバースピリット": return "Silver Spirit"; case "シルバーセラフ": return "Silver Seraph"; case "シルバードーン": return "Silver Dawn"; case "パークウォード": return "Park Ward"; case "ファントム": return "Phantom"; case "ファントムドロップヘッドクーペ": return "Phantom Drophead Coupe"; case "ファントムクーペ": return "Phantom Coupe";
            case "アズール": return "Azure"; case "アルナージ": return "Arnage"; case "エイト": return "Eight"; case "コンチネンタル": return "Continental"; case "コンチネンタルGT": return "Continental GT"; case "コンチネンタルGTC": return "Continental GTC"; case "コンチネンタルクーペ": return "Continental Coupe"; case "コンチネンタルコンバーチブル": return "Continental Convertible"; case "コンチネンタルスーパースポーツ": return "Continental Supersports"; case "ターボ": return "Turbo"; case "ブルックランズ": return "Brooklands"; case "ミュルザンヌ": return "Mulsanne"; case "コンチネンタルGTコンバーチブル": return "Continental GT Convertible"; case "フライングスパー": return "Flying Spur"; case "ベンテイガ": return "Bentayga";
            case "T350": return "T350"; case "キミーラ": return "Kimera"; case "グリフィス": return "Griffith"; case "サーブラウ": return "Cerbera"; case "サガリス": return "Sagaris"; case "タスカン": return "Tuscan"; case "タスカンコンバーチブル": return "Tuscan Convertible"; case "タモーラ": return "Tamora";
            case "エヴォーラ": return "Evora"; case "エキシージ": return "Exige"; case "エスプリ": return "Esprit"; case "エラン": return "Elan"; case "エリーゼ": return "Elise"; case "ヨーロッパ": return "Europa";
            case "デイムラー": return "Daimler";
            case "Ｆ": return "F"; case "ＲＶ８": return "RV8"; case "ＴＦ": return "TF"; case "ＺＴ": return "ZT"; case "ＺＴ-Ｔ": return "ZT-T";
            case "300C": return "300C"; case "300Cツーリング": return "300C Touring"; case "300M": return "300M"; case "PTクルーザー": return "PT Cruiser"; case "PTクルーザーカブリオ": return "PT Cruiser Cabrio"; case "アクレイム": return "Acclaim"; case "インペリアル": return "Imperial"; case "グランドボイジャー": return "Grand Voyager"; case "クロスファイア": return "Crossfire"; case "クロスファイアロードスター": return "Crossfire Roadster"; case "ストラトス": return "Stratos"; case "デイトナ": return "Daytona"; case "ニューヨーカー": return "New Yorker"; case "ネオン": return "Neon"; case "ビジョン": return "Vision"; case "プレミア": return "Premier"; case "ボイジャー": return "Voyager"; case "ルバロン": return "LeBaron"; case "ルバロンコンバーチブル": return "LeBaron Convertible"; case "イプシロン": return "Epsilon"; case "300": return "300";
            case "Ka": return "Ka"; case "イクシオン": return "Ixion"; case "エクスプローラー": return "Explorer"; case "エクスプローラースポーツトラック": return "Explorer Sport Trac"; case "エスケープ": return "Escape"; case "ギャラクシー": return "Galaxy"; case "クーガ": return "Kuga"; case "サンダーバード": return "Thunderbird"; case "スペクトロン": return "Spectron"; case "テルスター": return "Telstar"; case "テルスターII": return "Telstar II"; case "テルスターTX5": return "Telstar TX5"; case "テルスターワゴン": return "Telstar Wagon"; case "トーラス": return "Taurus"; case "トーラスワゴン": return "Taurus Wagon"; case "フィエスタ": return "Fiesta"; case "フェスティバ": return "Festiva"; case "フェスティバセダン": return "Festiva Sedan"; case "フェスティバミニワゴン": return "Festiva Mini Wagon"; case "フォーカス": return "Focus"; case "フォーカスC-MAX": return "Focus C-MAX"; case "フォーカスワゴン": return "Focus Wagon"; case "フリーダ": return "Freda"; case "プローブ": return "Probe"; case "ブロンコ": return "Bronco"; case "マスタング": return "Mustang"; case "マスタングコンバーチブル": return "Mustang Convertible"; case "モンデオ": return "Mondeo"; case "モンデオワゴン": return "Mondeo Wagon"; case "レーザー": return "Laser"; case "レーザーハッチバック": return "Laser Hatchback"; case "レーザーリデア": return "Laser Lynx"; case "レーザーリデアワゴン": return "Laser Lynx Wagon"; case "J80": return "J80"; case "J100": return "J100"; case "エコスポーツ": return "EcoSport";
            case "グランドチェロキー": return "Grand Cherokee"; case "コマンダー": return "Commander"; case "チェロキー": return "Cherokee"; case "パトリオット": return "Patriot"; case "ラングラー": return "Wrangler"; case "コンパス": return "Compass"; case "レネゲード": return "Renegade";
            case "Ｈ２": return "H2"; case "Ｈ３": return "H3";
            case "ＳＣ２": return "SC2"; case "ＳＬ２": return "SL2"; case "ＳＷ２": return "SW2";
            case "CTS": return "CTS"; case "CTSクーペ": return "CTS Coupe"; case "CTSスポーツワゴン": return "CTS Sport Wagon"; case "DTS": return "DTS"; case "SRX": return "SRX"; case "SRXクロスオーバー": return "SRX Crossover"; case "STS": return "STS"; case "XLR": return "XLR"; case "アランテ": return "Allanté"; case "エスカレード": return "Escalade"; case "エルドラド": return "Eldorado"; case "コンコース": return "Concours"; case "セビル": return "Seville"; case "ドゥビル": return "DeVille"; case "フリートウッド": return "Fleetwood"; case "フリートウッドクーペ": return "Fleetwood Coupe"; case "ATS": return "ATS"; case "XTS": return "XTS"; case "ATSクーペ": return "ATS Coupe"; case "CT6": return "CT6"; case "XT5クロスオーバー": return "XT5 Crossover";
            case "HHR": return "HHR"; case "MW": return "MW"; case "S-10ブレイザー": return "S-10 Blazer"; case "アストロ": return "Astro"; case "エクスプレス": return "Express"; case "オプトラ": return "Optra"; case "オプトラワゴン": return "Optra Wagon"; case "カマロ": return "Camaro"; case "カマロコンバーチブル": return "Camaro Convertible"; case "クルーズ": return "Cruze"; case "コルベット": return "Corvette"; case "コルベットコンバーチブル": return "Corvette Convertible"; case "シルバラード": return "Silverado"; case "タホ": return "Tahoe"; case "トラバース": return "Traverse"; case "トレイルブレイザー": return "Trailblazer"; case "ブレイザー": return "Blazer"; case "キャプティバ": return "Captiva"; case "ソニック": return "Sonic";
            case "LS": return "LS"; case "MKX": return "MKX"; case "コンチネンタル": return "Continental"; case "タウンカー": return "Town Car"; case "ナビゲーター": return "Navigator"; case "マークVIII": return "Mark VIII";
            case "グランドマーキー": return "Grand Marquis"; case "コロニーパーク": return "Colony Park"; case "セーブル": return "Sable"; case "セーブルワゴン": return "Sable Wagon";
            case "パークアベニュー": return "Park Avenue"; case "リーガル": return "Regal"; case "リーガルクーペ": return "Regal Coupe"; case "リーガルワゴン": return "Regal Wagon";
            case "JC": return "JC"; case "アベンジャー": return "Avenger"; case "キャリバー": return "Caliber"; case "チャージャー": return "Charger"; case "ナイトロ": return "Nitro";
            case "グランダム": return "Grand Am"; case "グランダムクーペ": return "Grand Am Coupe"; case "グランプリ": return "Grand Prix"; case "トランザム": return "Trans Am"; case "ボンネビル": return "Bonneville";
            case "240": return "240"; case "240エステート": return "240 Estate"; case "480": return "480"; case "740": return "740"; case "740エステート": return "740 Estate"; case "760": return "760"; case "760エステート": return "760 Estate"; case "780": return "780"; case "850": return "850"; case "850エステート": return "850 Estate"; case "940": return "940"; case "940エステート": return "940 Estate"; case "960": return "960"; case "960エステート": return "960 Estate"; case "C30": return "C30"; case "C70": return "C70"; case "C70カブリオレ": return "C70 Convertible"; case "S40": return "S40"; case "S60": return "S60"; case "S70": return "S70"; case "S80": return "S80"; case "S90": return "S90"; case "V40": return "V40"; case "V50": return "V50"; case "V70": return "V70"; case "V70XC": return "V70XC"; case "V90": return "V90"; case "XC60": return "XC60"; case "XC70": return "XC70"; case "XC90": return "XC90"; case "V60": return "V60"; case "V40クロスカントリー": return "V40 Cross Country"; case "V60クロスカントリー": return "V60 Cross Country"; case "V90クロスカントリー": return "V90 Cross Country"; case "XC40": return "XC40";
            case "900": return "900"; case "900クーペ": return "900 Coupe"; case "900カブリオレ": return "900 Convertible"; case "9000": return "9000"; case "9000セダン": return "9000 Sedan"; case "9-3": return "9-3"; case "9-3カブリオレ": return "9-3 Convertible"; case "9-３スポーツエステート": return "9-3 Sport Estate"; case "9-3Ｘ": return "9-3X"; case "9-5": return "9-5"; case "9-5エステート": return "9-5 Estate";
            case "i30": return "i30"; case "i30cw": return "i30cw"; case "JM": return "JM"; case "TB": return "TB"; case "XG": return "XG"; case "エラントラ": return "Elantra"; case "エラントラセダン": return "Elantra Sedan"; case "クーペ": return "Coupe"; case "グレンジャー": return "Grandeur"; case "サンタフェ": return "Santa Fe"; case "ソナタ": return "Sonata"; case "トラジェ": return "Trajet";
            case "D8": return "D8";
            case "レンジャー": return "Ranger"; case "dutro": return "Dutro"; case "レインボー": return "Rainbow"; case "プロフィア": return "Profia"; case "リエッセⅡ": return "Riess II"; case "リエッセ": return "Riess";
            case "Rosa": return "Rosa"; case "Super Great": return "Super Great";
            case "ビックサム (10-497)": return "Big Sam (10-497)";
            case "その他":
                return "Other";
            default:
                break;
        }
        return translation;
    };
    const translateHeader = (header) => {
        let translation;
        switch (header) {
            case "仕入No.":
                return "Stock ID";
            case "車名":
                return "Model";
            case "色":
                return "Color";
            case "型式":
                return "Model No.";
            case "年式":
                return "Model Year";
            case "ボディ形状":
                return "Body Type";
            case "排気量":
                return "Engine Displacement";
            case "ミッション":
                return "Mission";
            case "車台番号":
                return "Chassis / Frame Number";
            case "装備":
                return "Features";
            case "走行距離":
                return "Mileage";
            case "長さ":
                return "Length";
            case "幅":
                return "Width";
            case "高さ":
                return "Height";
            case "仕入価格(税抜)":
                return "FOB";
            case "展示場所":
                return "Port";
            case "販売担当":
                return "Sales";
            default:
                break;

        }
        return translation;
    };
    const translateBodyType = (bodyType) => {
        let translation;
        switch (bodyType) {
            case "ｸｰﾍﾟ":
                return "Coupe";
            case "ｵｰﾌﾟﾝ":
                return "Open";
            case "ｾﾀﾞﾝ":
                return "Sedan";
            case "ﾜｺﾞﾝ":
                return "Wagon";
            case "HB":
                return "Hatchback";
            case "ﾊﾞﾝ":
                return "Van";
            case "ﾄﾗｯｸ":
                return "Truck";
            case "SUV":
                return "SUV";
            case "Bus":
                return "Bus";
            default:
                break;
        }
        return translation;
    };
    const translatePorts = (port) => {
        let translation;
        switch (port) {
            case "本社":
                return "Head Office";
            case "HD　みよし":
                return "HD Miyoshi";
            case "輸出(神戸）":
                return "Kobe";
            case "輸出（NZ)":
                return "Export (NZ)";
            case "輸出（横浜）":
                return "Yokohama";
            case "輸出（九州）":
                return "Kyushu";
            case "輸出（本社）":
                return "Export (Head Office)";
            case "輸出（名港）":
                return "Nagoya";
            case "自販の在庫":
                return "Sales Department Stock";
            case "HDﾄﾗｯｸの在庫":
                return "HD Truck Stock";
            case "トラスタ":
                return "Truster";
            case "書類入庫":
                return "Document Storage";
            case "代車":
                return "Substitute Car";
            case "Zambia Office ":
                return "Zambia Office";
            case "NZ Office":
                return "NZ Office";
            case "Tanzania Office":
                return "Tanzania Office";
            case "社用車":
                return "Company Car";
            case "豊南自動車":
                return "Toyonan Motor Co.";
            case "本社（AS）":
                return "Head Office (AS)";
            case "本地ﾔｰﾄﾞ（AS）":
                return "Local Yard (AS)";
            case "輸出（本社AS）":
                return "Export (Head Office AS)";
            case "トラック市第1展示場":
                return "Truck Market 1st Showroom";
            case "日立ﾘｰｽ":
                return "Hitachi Lease";
            case "ﾘｺｰﾘｰｽ":
                return "Ricoh Lease";
            case "ﾘｺｰﾛｰﾝ":
                return "Ricoh Loan";
            case "三井ﾘｰｽ":
                return "Mitsui Lease";
            case "三井ﾛｰﾝ":
                return "Mitsui Loan";
            case "SMFLﾘｰｽ":
                return "SMFL Lease";
            case "SMFLﾛｰﾝ":
                return "SMFL Loan";
            case "RMJ輸出(三利）":
                return "RMJ Export (Sanri)";
            case "輸出　Zambia":
                return "Export Zambia";
            case "ﾎﾞﾃﾞｨｰ":
                return "Body";
            case "ﾗｼﾞｺﾝ":
                return "Lagicon";
            case "台風　六甲":
                return "Typhoon Rokko";
            case "トラック王国":
                return "Truck Kingdom";
            case "HD　明石":
                return "HD Akashi";
            case "田代ヤード":
                return "Tashiro Yard";
            case "自販　明石":
                return "Sales Department Akashi";
            case "ｵｰｸﾈｯﾄﾔｰﾄﾞ":
                return "Oak Net Yard";
            case "共有ﾄﾗｯｸ・輸出":
                return "Shared Truck & Export";
            case "田代　共有":
                return "Tashiro Shared";
            case "償却":
                return "Amortization";
            case "MIRIVE愛知":
                return "MIRIVE Aichi";
            case "セントパーツ":
                return "Cent Parts";
            default:
                break;
        }
        return translation;
    }
    const [featureDataString, setFeatureDataString] = useState([]);
    console.log('FEATURES', featureDataString);


    return (
        <View style={styles.container}>
            <Button title="Upload CSV" onPress={handleUploadFirebase} />

            <View style={styles.row}>
                <Text style={styles.cell}>Stock ID</Text>
                <Text style={styles.cell}>Chassis Number</Text>
                <Text style={styles.cell}>Make</Text>
                <Text style={styles.cell}>Model</Text>
                <Text style={styles.cell}>Date Added</Text>
                <Text style={styles.cell}>Uploaded</Text>
            </View>
            {uploadedData.map((item, index) => (
                <View style={styles.row} key={index}>
                    <Text style={styles.cell}>{item.stockId}</Text>
                    <Text style={styles.cell}>{item.chassisNumber}</Text>
                    <Text style={styles.cell}>{item.make}</Text>
                    <Text style={styles.cell}>{item.model}</Text>
                    <Text style={styles.cell}>{item.dateUploaded}</Text>
                    <Text style={styles.cell}>{item.uploaded ? '✅' : '❌'}</Text>
                </View>
            ))}

            {/* {data.length > 0 && (
                <View style={styles.table}>
                    <View style={styles.row}>

                        {Object.keys(data[0]).map((header, index) => (
                            <View style={styles.cell} key={index}>
                                <Text style={styles.cellText}>{translateHeader(header)}</Text>
                            </View>
                        ))}
                        <View style={styles.cell}>
                            <Text style={styles.cellText}>Make</Text>
                        </View>
                    </View>

                    {data.map((item, index) => (
                        <View style={styles.row} key={index}>

                            {Object.entries(item).map(([key, value], index) => (
                                <View style={styles.cell} key={index}>
                                    {key === "車名" ? (
                                        <Text>
                                            {translateCarModel(value)}
                                            {carModelCounts[translateCarModel(value)] !== undefined &&
                                                ` (Count: ${carModelCounts[translateCarModel(value)]})`}
                                        </Text>
                                    ) : key === "ボディ形状" ? (
                                        <Text>{translateBodyType(value)}</Text>
                                    ) : key === "展示場所" ? (
                                        <Text>{translatePorts(value)}</Text>
                                    ) : key === "年式" ? (
                                        <Text>{convertJpDateToGregorian(value)}</Text>
                                    )
                                        : key === "装備" ? (
                                            <View>
                                                {value && typeof value === 'string' ? (
                                                    value.split('・').map((item, index) => (
                                                        <Text key={index}>{item}</Text>
                                                    ))
                                                ) : (
                                                    <Text>{value}</Text>
                                                )}
                                            </View>
                                        ) : (
                                            <Text>{value}</Text>
                                        )}
                                </View>
                            ))}
                            <View style={styles.cell}>
                                <Text>{getMakeFromModel(item['車名'])}</Text>
                            </View>
                        </View>
                    ))}
                </View>
            )} */}
        </View>
    );
}
const styles = StyleSheet.create({
    container: {
        flex: 1,
        padding: 10,
    },
    row: {
        flexDirection: 'row',
        justifyContent: 'space-between',
        borderBottomWidth: 1,
        borderColor: '#ccc',
        paddingVertical: 5,
    },
    cell: {
        flex: 1,
        textAlign: 'center',
    },
});
export default UploadCsv


//
//          {data.length > 0 && (
//   <View style={styles.table}>
// <View style={styles.row}>
//   {Object.keys(data[0]).map((header, index) => (
//     <View style={styles.cell} key={index}>
//       <Text style={styles.cellText}>{header}</Text>
// </View>
// ))}
//</View>

//{data.map((item, index) => (
//<View style={styles.row} key={index}>
//{Object.values(item).map((value, index) => (
//  <View style={styles.cell} key={index}>
//   <Text>{value}</Text>
// </View>
// ))}
//</View>



//{key === "車名" ? (
//  <Text>{translateCarModel(value)}</Text>
//) : (
//    <Text>{value}</Text>
//)}





// ))}
// </View>
// )}

//


